{
  "3219025813": {
    "time_read": "2021-06-01",
    "title": "My year in data",
    "author": [],
    "link": "https://samplesize.one/blog/posts/my_year_in_data/",
    "tags": [
      "productivity--tips",
      "time__management"
    ],
    "annotations": [
      "The moment I started, every day became an exercise in optimisation",
      "This is already pretty cool, but the most important outcome of introducing these points is that I stopped thinking about productivity in binary terms. Before the points, whenever I was too tired to do work, my thinking process would go like this: \"Since I'm not doing work (bad), I might as well scroll some social media (also bad)\", while after the points this became \"Alright, I am too tired to do work (not gaining 4 points) but maybe I can read a book (3 points) or go for a walk and listen to a podcast (3 points) instead\"",
      "Another important consideration is that 'hours spent on' is not a great measure of productivity - I want to achieve things and not just spend time doing busywork. To make sure that this is the case, I do weekly summaries, where I compare what I wanted to accomplish vs what I actually did accomplish in the past week and plan for the upcoming week.",
      "As I was analysing at my data throughout the year, I was quite disappointed in how little I worked and was looking for a way to increase it. Inspired by this post I decided to gamify my productivity by giving myself points for activities I wanted to do more of. I was hoping that they would act as sources of instantenous pleasure for my monkey brain (which wants fun now and doesn't really care about future me) to make it do things that might be less fun but beneficial in the long run. "
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3198490760": {
    "time_read": "2021-05-16",
    "title": "The True Meaning of Technical Debt 💸",
    "author": [
      "Luca Rossi"
    ],
    "link": "https://refactoring.fm/p/the-true-meaning-of-technical-debt",
    "tags": [
      "product__management"
    ],
    "annotations": [
      "Increasing Design effort brings diminishing results after a while, so it's up to you to find the sweet spot, based on how solid is your company planning vs how much change you can expect in the future.",
      "Ward describes debt as the natural result of writing code about something we don't have a proper understanding of.\nHe doesn't talk of poor code — which he says accounts for a very minor share of debt.\nHe talks of disagreement between business needs and how the software has been written.",
      "Actually learning along the way — analyze, with the help of stakeholders, what still fits and what is going to become debt.",
      "It's intuitive and backed by common sense — something that piles up and makes you slower and slower, just like interest on existing debt.",
      "Spending regular time on refactoring — reorganize the code periodically to reflect your updated understanding. This is easy to dismiss, letting the debt pile up until it’s too late and you need a big rewrite. Taking baby steps every time is more sustainable both for your business, and your development team.",
      "A thorough Design phase provides limited protection against future changes, so a leaner cycle might work better",
      "Rapid Evolution — we built the right thing, but the landscape changed quickly and made it obsolete.",
      "Wrong Design — what we built was wrong from the start!",
      "Requirements may still be met on the surface, but something is wrong under the hood — an abstraction that doesn't fit, some duplication, scalability issues, and so on.",
      "even if we build the right thing, it risks becoming obsolete fast, because of the ever-changing business landscape."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3321687207": {
    "time_read": "2021-05-16",
    "title": "Hosting SQLite databases on Github Pages",
    "author": [],
    "link": "https://phiresky.github.io/blog/2021/hosting-sqlite-databases-on-github-pages/",
    "tags": [
      "programming__database",
      "web__devops"
    ],
    "annotations": [
      "The above query should do 10-20 GET requests, fetching a total of 130 - 270KiB, depending on if you ran the above demos as well. Note that it only has to do 20 requests and not 270 (as would be expected when fetching 270 KiB with 1 KiB at a time). That’s because I implemented a pre-fetching system that tries to detect access patterns through three separate virtual read heads and exponentially increases the request size for sequential reads. This means that index scans or table scans reading more than a few KiB of data will only cause a number of requests that is logarithmic in the total byte length of the scan. ",
      "All of this only works well when we have indices in the database that match the queries well. For example, the index used in the above query is a INDEX ON wdi_data (indicator_code, country_code, year, value). If that index did not include the value column, the SQLite engine would have to do another random access (unpredictable) read and thus HTTP request to retrieve the actual value for every data point. If the index was ordered country_code, indicator_code, ..., then we would be able to quickly get all indicators for a single country, but not all country values of a single indicator.",
      "Since fetching data via HTTP has a pretty large overhead, we need to fetch data in chunks and find some balance between the number of requests and the used bandwidth. Thankfully, SQLite already organizes its database in \"pages\" with a user-defined page size (4 KiB by default). I’ve set the page size to 1 KiB for this database.",
      "From SQLite’s perspective, it just looks like it’s living on a normal computer with an empty filesystem except for a file called /wdi.sqlite3 that it can read from. Of course it can’t write to this file, but a read-only database is still very useful.",
      "sql.js only allows you to create and read from databases that are fully in memory though - so I implemented a virtual file system that fetches chunks of the database with HTTP Range requests when SQLite tries to read from the filesystem: sql.js-httpvfs.",
      "So how do you use a database on a static file hoster? Firstly, SQLite (written in C) is compiled to WebAssembly. SQLite can be compiled with emscripten without any modifications, and the sql.js library is a thin JS wrapper around the wasm code."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2637134274": {
    "time_read": "2021-05-03",
    "title": "A few things I wish I knew before I started working as a software engineer",
    "author": [
      "Shubheksha Jalan"
    ],
    "link": "https://shubheksha.com/posts/2019/06/a-few-things-i-wish-i-knew-before-i-started-working-as-a-software-engineer/",
    "tags": [
      "career--tips"
    ],
    "annotations": [
      "Here’s what to look for in good leader: kindness, empathy, emotional intelligence. They should be good listeners, be your advocate where possible, help you advocate for yourself and help you do what’s best for your career even when it’s uncomfortable.",
      "Avoid bad managers/jobs (if you can):",
      "In the long run, it does more harm than good in the sense that the effects of a toxic job outlive the job itself.",
      "Invest in building a network early on",
      "Building software is so much more than writing code",
      "The importance of good leaders",
      "Most of the time, the hardest problem is figuring out what code to write and ensuring we’re solving the correct problem rather than figuring out how to write it. The latter is much easier than figuring out the former. Estimation and prioritisation is also super hard. Being a software engineer isn’t about sitting in a corner and writing code all day. It’s an inherently collaborative process that needs a wide variety of skills, especially people skills. "
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2936982718": {
    "time_read": "2021-04-16",
    "title": "We Get, and Give, Lots of Bad Advice. Here’s How to Stop.",
    "author": [
      "ADAM GRANT"
    ],
    "link": "https://www.nytimes.com/2020/04/02/smarter-living/how-to-give-better-advice.html",
    "tags": [
      "career--tips",
      "life--tips",
      "psychology"
    ],
    "annotations": [
      "At some point, you have probably noticed that you’re wiser when giving advice to others than you are in making decisions for yourself. You’re not alone. In psychology, it’s called Solomon’s paradox, and it often happens because we have more distance from other people’s problems than our own",
      "“Today, the world is changing so fast that people become wise for a world that’s no longer there,” the Wait but Why blogger Tim Urban said on my TED podcast, “WorkLife.”",
      "Anxiety impairs our information processing, making it difficult for us to distinguish between good and bad advice and recognize conflicts of interest.",
      "The problem starts with who we approach for advice: We often listen to the wrong sources. I’ve watched many students rely on their parents and grandparents for guidance, forgetting that they were raised in an era when it was common to spend an entire career in one organization.",
      "When people come to us for advice, we can resist the urge to give them a single recommendation. People rarely need to hear our conclusion. They benefit from hearing our thought process and our perspective on the relevant criteria for making the choice. The most useful advice doesn’t specify what to do; it helps people see blind spots in their thinking and clarify their priorities.",
      "Although we say we want advice from people with relevant expertise and experience, we end up reaching out to the ones who are enthusiastic and approachable. ",
      "The lesson here is that one of the most effective ways to get better advice is to give it. Sure enough, psychologists find that our reasoning becomes wiser when we think about our own problems from a third-person perspective."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3133552346": {
    "time_read": "2021-04-16",
    "title": "A framework for focusing your learning goals",
    "author": [
      "Sally Lait"
    ],
    "link": "https://sallylait.com/blog/2020/09/11/focusing-your-learning-goals/",
    "tags": [
      "learning--tips",
      "productivity--tips"
    ],
    "annotations": [
      "First of all, what is it you want to work on?",
      "The more specific you get, the more of an enormous, seemingly never-ending list you’ll get, but the quicker you’ll see progress with ticking things off.",
      "Ask yourself what topic, and what level of detail you want to focus on",
      "What’s the worst that can happen if you don’t invest time in this area?",
      "It can be quite powerful when coupled with Lara Hogan’s favourite “what are you optimising for?” question as an overarching beacon",
      "When did this first come up?",
      "Note down if/when this will become a problem if you don’t learn it, and…",
      "Capture what you think is a realistic timescale for you to achieve the level that you need",
      "Does the length of time this has stood have a bearing on whether it should be a priority?",
      "Identify what the impact will be if you do/don’t spend time on this thing"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "1216699353": {
    "time_read": "2021-04-15",
    "title": "What's your anti-product roadmap?",
    "author": [],
    "link": "https://www.sequoiacap.com/india/article/anti-product-roadmap/",
    "tags": [
      "product__management",
      "psychology"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "3119040040": {
    "time_read": "2021-04-15",
    "title": "Cognitive load of software teams",
    "author": [
      "Joh Sweller"
    ],
    "link": "https://tonics.substack.com/p/cognitive-load-of-software-teams",
    "tags": [
      "psychology",
      "team__management"
    ],
    "annotations": [
      "Minimise intrinsic cognitive load (through training, good choice of technologies, hiring, pair programming, etc.)\n\n",
      "Eliminate extraneous cognitive load (boring or superfluous tasks or commands that add little value to retain in the working memory and can often be automated away).",
      "Germane Cognitive Load - load related to deep thinking - What should be the architecture of my system? What investments do we need to make for the future?",
      "Intrinsic Cognitive Load - load generated while doing your core job - how easy is it for you to write code?",
      "Extraneous Cognitive Load - load related to managing dependencies of your core job - how do I set up my service? How do I test my service? Who do I need to speak to get this working?",
      "Doing so allows more space for Germane cognitive load (which is where the “value add” thinking lies).",
      "Recognising the type of work that each team is engaged in should give you an indication of how much you can load up a team."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3236473980": {
    "time_read": "2021-04-14",
    "title": "Gatsby vs Next.js in 2021 - What, Why and When?",
    "author": [
      "Jamees Bedford"
    ],
    "link": "https://www.jame.es/gatsby-vs-next-js-2021/",
    "tags": [
      "web__frontend",
      "web__performance"
    ],
    "annotations": [
      "Also - GraphQL... Whilst it is undeniably cool, one of the main purposes is lost in this case. As I mentioned earlier in the article, GraphQL is there to cure over-fetching, but Gatsby's bread and butter is Static Sites, which means that fetching all of the data from the API's will cause no extensions to runtime, it would take marginally longer at build time granted, but for flexibility that seems a worthwhile trade.",
      "The fact that it is so opinionated on how you should be fetching your data, and the fact it focuses to intensely on the plugin ecosystem means that it is often hard to diverge from these",
      "Next.js is more versatile and flexible. If your project has the potential to grow beyond its current spec, I would go with Next",
      "But Gatsby makes it easier to get up and running quicker and achieve more with less coding. If you want to build something that is unlikely to diverge much from the current spec, Gatsby is a great choice.",
      "The main argument for Next this time last year was the fact it was flexible. It didn't force the developer into an ecosystem of plugins and GraphQL. Making Next.js able to Pre-render pages at build time (SSG) or request time (SSR) in a single project and give the developer to choose one or the other and switch between the two is a huge gain for flexibility.",
      "I made the statement in my last article that Gatsby is better for smaller applications, because if you have a massive amount of data you are going to want to potentially implement Server Side Rendering."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3263645559": {
    "time_read": "2021-04-13",
    "title": "How Chess.com built a streaming empire",
    "author": [],
    "link": "https://www.protocol.com/chess-streaming-twitch-hikaru-botez",
    "tags": [
      "product__marketing"
    ],
    "annotations": [
      "\"A few key content creators really wanted to tap into what we call the nostalgia meta … and chess became part of this.",
      "We were able to create this roster of diverse personalities so that someone could log on and watch an untitled player that might be at the same level they are or they could watch Grandmaster Hikaru Nakamura, who now has over a million followers on Twitch, and everything in between",
      "Chess.com put up $50,000 in prize money for the first PogChamps tournament in June 2020. It featured many of Twitch's top streamers, including xQc, Ludwig, moistCr1tikal and VoyBoy. Nakamura and Alexandra Botez coached the participants and later served as commentators for live matches. The inaugural tournament broke all sorts of viewership records, including the first chess stream to break 1 million unique views and the first time a chess video reached 150,000 concurrent viewers on Twitch.",
      "Streaming provided a secondary benefit to the chess community in that it gave lifelong players a new way to monetize their talents. Similar to aspiring professional athletes, chess amateurs often dedicate their youth to the game, hoping to become one of the top 20 or so players who can make a living on tournament earnings alone. If amateurs failed to reach this ultra-elite status, their remaining options within the chess world were primarily limited to coaching or migrating to the business side.",
      "His streams tap into the appeal of watching a prodigy show glimpses of being an otherwise ordinary person, as when Nakamura tries to identify the meat in his breakfast croissant or scrolls through memes posted by the r/HikaruNakamura subreddit.",
      "His camera presence improved, as did the channel's production value, thanks to a small team that included Chess.com employees."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3276427344": {
    "time_read": "2021-04-13",
    "title": "Things your manager might not know",
    "author": [
      "Julia Evans"
    ],
    "link": "https://jvns.ca/blog/things-your-manager-might-not-know/",
    "tags": [
      "career--tips"
    ],
    "annotations": [
      "Being good at telling your manager the right information at the right time and asking for what you need is a superpower. It makes you way more valuable to have on a team (because your manager knows they can trust you to give them the information they need), and it’s more likely that you’ll get what you want (because you’re making it easy for them to do that!).",
      "What your goals are",
      "What’s slowing the team down",
      "Exactly what individual people on the team are working on",
      "What extra work you’re doing",
      "How to help you get better at your job",
      "What issues they should be escalating",
      "Where the technical debt is"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "1236308843": {
    "time_read": "2021-04-11",
    "title": "Seven Zen Stories That Could Open Your Mind",
    "author": [
      "Melanie Pinola"
    ],
    "link": "https://lifehacker.com/seven-zen-stories-that-could-open-your-mind-1767039967",
    "tags": [
      "life--tips",
      "zen-stories"
    ],
    "annotations": [
      "“If nothing exists,” inquired Dokuon, “where did this anger come from?”"
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "108565326": {
    "time_read": "2021-04-11",
    "title": "How Will You Measure Your Life?",
    "author": [
      "Clayton M. Christensen"
    ],
    "link": "https://hbr.org/2010/07/how-will-you-measure-your-life",
    "tags": [
      "life--tips"
    ],
    "annotations": [
      " If they think that they’ll have more time and energy to reflect later, they’re nuts,",
      "And if your attitude is that only smarter people have something to teach you, your learning opportunities will be very limited.",
      "I asked all the students to describe the most humble person they knew. One characteristic of these humble people stood out: They had a high level of self-esteem.",
      "The lesson I learned from this is that it’s easier to hold to your principles 100% of the time than it is to hold to them 98% of the time.",
      "Clarity about their purpose will trump knowledge of activity-based costing, balanced scorecards, core competence, disruptive innovation, the four Ps, and the five forces.",
      "But if you have a humble eagerness to learn something from everybody, your learning opportunities will be unlimited.",
      "Justification for infidelity and dishonesty in all their manifestations lies in the marginal cost economics of “just this once.”",
      "But instead of telling him what to think, I taught him how to think—and then he reached what I felt was the correct decision on his own.",
      "Instead, I run the question aloud through one of my models. I’ll describe how the process in the model worked its way through an industry quite different from their own. And then, more often than not, they’ll say, “OK, I get it.” And they’ll answer their own question more insightfully than I could have.",
      "This is my final recommendation: Think about the metric by which your life will be judged, and make a resolution to live every day so that in the end, your life will be judged a success",
      "First, how can I be sure that I’ll be happy in my career? Second, how can I be sure that my relationships with my spouse and my family become an enduring source of happiness? Third, how can I be sure I’ll stay out of jail?",
      "Doing deals doesn’t yield the deep rewards that come from building up people",
      "If you want your kids to have strong self-esteem and confidence that they can solve hard problems, those qualities won’t magically materialize in high school. You have to design them into your family’s culture—and you have to think about this very early on",
      "who asserts that the powerful motivator in our lives isn’t money; it’s the opportunity to learn, grow in responsibilities, contribute to others, and be recognized for achievements. ",
      "Because companies’ decision-making systems are designed to steer investments to initiatives that offer the most tangible and immediate returns, companies shortchange investments in initiatives that are crucial to their long-term strategies."
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "1791867536": {
    "time_read": "2021-04-11",
    "title": "How I Got My Attention Back",
    "author": [
      "Craig Mod"
    ],
    "link": "https://www.wired.com/2017/01/how-i-got-my-attention-back/",
    "tags": [
      "productivity--tips",
      "psychology",
      "technology"
    ],
    "annotations": [
      "We were reasonably autonomous things. Now we’re indifferently synchronous, easily manipulated.",
      "And yet, the quietude of those disconnected days evaporated as soon as I came back online. It was a shock to feel my mind returning so quickly to where it was before — namely, away. Elsewhere. My attention so eager to latch onto whatever cleverly architected spaceship of dopamine was flying out from my consciousness.",
      "In “Gravity and Grace,” Simone Weil writes, “Attention, taken to its highest degree, is the same thing as prayer. It presupposes faith and love.” Then is the lack of attention the opposite? Does it presuppose fear and hate?",
      "There are a thousand beautiful ways to start the day that don’t begin with looking at your phone. And yet so few of us choose to do so.",
      "It was none of these things. It was all of these things. Whatever it was, it robbed us of our attention and, with that, our compassion",
      "When the scale of our systems with which we interact breaches our comprehension, and control of attention is weakened en masse, the opportunity for manipulation arises. ",
      "Attention is a muscle. It must be exercised. Though, attention is duplicitous — it doesn’t feel like a muscle. And exercising it doesn’t result in an appreciably healthier looking body. But it does result in a sense of grounding, feeling rational, control of your emotions — a healthy mind. Our measuring sticks for life tend to be optimized for material things, things easy to count. Houses, cars, husbands, babies, dollar bills. Attention is immaterial, difficult to track.",
      "I pulled the plug. Deleted the app. Deleted the Game Center account. The data was gone (I hoped, I haven’t checked). A weight was temporarily lifted",
      " I set a goal—some level, some league that seemed just on the edge of “enough.” Make it over that line and I’d pull the plug. ",
      "It was so perfectly tuned to my most primitive set of chemical desires that it was actually beautiful — a thing of beauty",
      "How technologies inevitably amplify ourselves — the best and worst parts",
      "Total disconnection is not only unsustainable for most people, but can also be an unnecessary act of self-sabotage.",
      "All of humanity’s problems stem from man’s inability to sit quietly in a room alone,” wrote Blaise Pascal",
      "While some blame our collective tech addiction on personal failings, like weak willpower, Harris points a finger at the software itself. That itch to glance at our phone is a natural reaction to apps and websites engineered to get us scrolling as frequently as possible. The attention economy, which showers profits on companies that seize our focus, has kicked off what Harris calls a “race to the bottom of the brain stem.” “You could say that it’s my responsibility” to exert self-control when it comes to digital usage, he explains, “but that’s not acknowledging that there’s a thousand people on the other side of the screen whose job is to break down whatever responsibility I can maintain.” In short, we’ve lost control of our relationship with technology because technology has become better at controlling us.",
      "Take the morning. Hell, just take the first hour of the morning. Make a plan. Own your attention. A lack of ownership of attention can only make you a weaker leader. Can only make you a less potent and thoughtful member of your community.",
      " I sensed they knew I had a goal, and they turned that goal into an unobtainable carrot",
      "“We believe that we live in the ‘age of information.’” he writes. “That there has been an information ‘explosion,’ an information ‘revolution.’ While in a certain narrow sense this is the case, in many important ways just the opposite is true. We also live at a moment of deep ignorance, when vital knowledge that humans have always possessed about who we are and where we live seems beyond our reach. An Unenlightenment. An age of missing information.”"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "1676706674": {
    "time_read": "2021-04-11",
    "title": "The 1 Percent Rule: Why a Few People Get Most of the Rewards",
    "author": [
      "James Clear"
    ],
    "link": "https://jamesclear.com/the-1-percent-rule",
    "tags": [
      "business__management",
      "productivity--tips",
      "psychology"
    ],
    "annotations": [
      "The 1 Percent Rule states that over time the majority of the rewards in a given field will accumulate to the people, teams, and organizations that maintain a 1 percent advantage over the alternatives. ",
      "Pareto noticed that a tiny number of pea pods in his garden produced the majority of the peas.",
      "One plant only needs a slight edge in the beginning to crowd out the competition and take over the entire forest.",
      "Situations in which small differences in performance lead to outsized rewards are known as Winner-Take-All Effects",
      "Soon, you begin to understand why a few books sell millions of copies while the majority struggle to sell a few thousand copies.",
      "From this advantageous position, the winning plant has a better ability to spread seeds and reproduce, which gives the species an even bigger footprint in the next generation. This process gets repeated again and again until the plants that are slightly better than the competition dominate the entire forest.",
      "Small differences in performance can lead to very unequal distributions when repeated over time. ",
      "accumulative advantage.",
      "The Matthew Effect, which references a passage in The Bible that says, “For all those who have, more will be given, and they will have an abundance; but from those who have nothing, even what they have will be taken away.”",
      "The majority of rewards always seemed to accrue to a small percentage of people.",
      " Just 1.4 percent of tree species account for 50 percent of the trees in the Amazon"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3151207364": {
    "time_read": "2021-04-11",
    "title": "Find Freedom of the Mountain in Everything You Do",
    "author": [
      "Leo Babauta"
    ],
    "link": "https://zenhabits.net/freeing/",
    "tags": [
      "life--tips",
      "psychology--tips"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "2993377125": {
    "time_read": "2021-04-11",
    "title": "Want to Be More Productive? Try Doing Less.",
    "author": [
      "Kate Northrup"
    ],
    "link": "https://hbr.org/2020/05/want-to-be-more-productive-try-doing-less",
    "tags": [
      "productivity--tips"
    ],
    "annotations": [
      "Often the things we think we “must” do are simply because we always have done them or others around us do them and we think we should, too",
      "Be ruthless",
      "We need to identify what not to do",
      "when your preteen bared their soul to you and you felt so honored by how safe they felt to tell you the hard stuff.",
      " We have not been culturally conditioned to celebrate ourselves, so often, folks will draw a blank when listing their “wins.” ",
      " When you stop doing the things that make you feel busy but aren’t getting you results (and are draining you of energy), then you end up with more than enough time for what matters "
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2883849147": {
    "time_read": "2021-04-11",
    "title": "How to reduce 'attention residue' in your life",
    "author": [
      "Madeleine Dore"
    ],
    "link": "https://www.bbc.com/worklife/article/20200130-the-life-hack-to-reduce-admin-and-carve-out-downtime",
    "tags": [
      "productivity--tips"
    ],
    "annotations": [
      "could work for some but not others. “We all have different preferences for dealing with life admin,” says Emens. ",
      "Yet I fell at the first hurdle: picking the day to do all these tasks, as other events and deadlines competed for my attention",
      "If you have attention residue, you are basically operating with part of your cognitive resources being busy, and that can have a wide range of impacts – Sophie Leroy",
      "Attention residue’ describes the way our attention is split when we have multiple tasks or obligations on our plate, reducing our overall performance ",
      ". “In my first year, GYLIO week ended up being stressful because I had too much to do,” she recalls. ",
      "yet it is also true that if we don't sometimes put the self-care first, we will never get to it",
      "Whether you call it an admin morning, a ‘power hour’ or GYLIO, bundling small, unrelated chores can be a useful tool for making the invisible, visible",
      "with an ‘always on’ culture leaving little energy for the smaller tasks.",
      "If you are going to put 22 items on your to-do list but not actually move into action, your brain is going keep thinking about those 22 things that are not done",
      "In my case, the GYLIO experiment proved that self-care is less about carving out time to relax amid chaos, and more about removing to-dos from our crowded lives.",
      "Emens believes we need to find the balance between getting life admin done and safeguarding our wellbeing"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3101742848": {
    "time_read": "2021-03-22",
    "title": "A detailed technical description of the site!",
    "author": [],
    "link": "https://blog.covid19india.org/2020/09/04/architecture/",
    "tags": [
      "programming__automation",
      "web__backend"
    ],
    "annotations": [],
    "favorite": 1,
    "source": "pocket"
  },
  "3221634186": {
    "time_read": "2021-02-19",
    "title": "How money works",
    "author": [
      "Paras Chopra"
    ],
    "link": "https://invertedpassion.com/how-money-works/",
    "tags": [
      "money"
    ],
    "annotations": [
      "Money is simply a commodity with the widest price discovery against all other commodities and because of that everyone accepts it. That is what gives money its purchasing power.",
      "Nobody decides how many grams of gold is a cow worth. The market gradually determines this exchange rate by accounting for supply and demand for both commodities: gold and cows.",
      "Little did the public know that by doing this they’re setting themselves for the erosion of their purchasing power. Originally one dollar was one ounce (~31 grams) of silver. Today, that value has eroded over 96% and for one dollar you’ll only get 0.04 ounces of silver.",
      "The key to understanding money is to remember that it is a commodity whose utility is in facilitating exchanges, just like leather is a commodity whose utility is in making shoe soles.",
      "Such coin debasement is a subtle way of stealing (or redistribution, depending on how you look at things). In other words, debasement leads to inflation. You have more coins in circulation for a similar amount of “stuff” in the world so the prices of “stuff” rise.",
      "Network effects mean that the more widely a currency is accepted by others, the more likely is it to get accepted by others. (This is also why bitcoin is the mother of all network effects).",
      "Here’s the pitch of the govt to its citizens: a central bank will be established that will hold all the coin reserves of the public. By law, private banks couldn’t keep their reserves as coins but had to hand them over to the central bank. The central bank in return would give its own banknotes which different private banks will keep as reserves.",
      "This means, over time, the rich get richer (in purchasing power) but the poor get less portion of the purchasing power and hence the wealth gap rises. However, the poor can afford more things and hence poverty reduces over time.",
      "So, fiat-based currency helps the government manage the economy, which is great for the economy and actually helps money move faster and do its job as a medium of exchange. However, because government can interfere at will, it can be counter productive to people who’ve worked hard and accumulated money. Their historically earned money’s purchasing power will go down as government helps the economy by injecting more money.",
      "To drive home this point, consider money as a commodity (like milk) that you can buy. What do you pay to “buy” money? Your goods and services. What do you get in return when you “sell” money? Other people’s goods and services.",
      "Temporary measures that benefit an entity in power soon become permanent, so such temporary abandonment of backing paper money with reserves set the stage for a more permanent abandonment of the gold standard later.",
      "This way, a banknote becomes a substitute for coins. It’s important to understand that banknotes were not money but a money-substitute. Papers were merely a placeholder for the real thing.",
      "65/ Now, if you’ve used the borrowed $100 to pay to someone who holds an account in the same bank, what the bank does is debit your account and credit the other person’s account. So, your database entry will now say $0 and the other person’s account will be increased by $100.\n66/ Note how no currency/cash was involved in the entire transaction and yet for $100 for central bank-issued cash, there’s now $200 worth of money in the economy. This is called money multiplication",
      "Citizens have an incentive to evade taxation, and it’s also an operational nightmare. An easy and convenient alternative to taxation is controlling the money supply in the state. You can call it indirect confiscation.",
      "The biggest benefit of money is in expanding the trade between people, and hence rewarding specialization. Increasing specialization creates prosperity as now you don’t just have shoes, you have sports shoes, party shoes, formal shoes, and so on. So, multiple types of shoes can exist because consumer desire for everything can now be measured in money.",
      "Even without gold backing, the reason the US dollar is still the global reserve currency is that they require oil-producing middle east regions to price their oil in dollars (in exchange for “protection” and “good relations”?). Since most nations in the world import oil, the demand for dollars (even though it is not gold-backed) persists",
      "Here’s how the coin debasement works: you stamp coins with your brand, you outlaw all other coins, you require taxes to be paid in stamped coins and when you get coins, you literally melt them and make more coins, each with less weight than before. You keep some of the newly invented coins for yourself and release the remaining.",
      "This inter-bank redemption for coins places a natural limit to how much “phantom” bank notes can circulate in the system. If banks could form a cartel and not redeem each others’ bank notes, they all can keep on growing their profits together.",
      "This warehousing of coins at one central place opens up the possibility of another debasement type of scam. Banks over time realize that because everybody doesn’t redeem their money at once, they can print and issue more banknotes than the coin reserves they have in their warehouse.",
      "Today, the demand and supply for different fiat currencies is either freely determined in the market (freely-floating exchange rates) or is determined by the country (like in China where its central bank determines the Yuan-USD exchange rate).",
      "Similar dynamics happen with money. Only by increasing the amount of money, no prosperity happens. Prosperity happens via innovation – when there are more (in number and type) goods and services available for people to enjoy.",
      "Kings and rulers of the past depended on direct confiscation of commodities as a way to sustain their armies and lifestyle. This is how taxation came along.",
      "For example, if a widget costs 3 yuans to make, under free-market conditions, you can only buy one widget for one dollar from china. But because of the Chinese central bank’s artificial undervaluing of yuan, you can now buy 2 widgets. Hence Chinese exports surge.",
      "Rather, the prudent thing is to hold assets that lay a claim on some portion of the economy. The best example of such a claim-on-economy is stocks and within stocks, index funds have the best tradeoff for the amount of time you’re willing to invest in researching and returns you’re able to generate.",
      "So the physics-based limits on how light coins can get keeps infinite debasement in check. And because debasement is in check, new money can’t be created indefinitely, so inflation is in check. But that game is about to get changed when governments and kings discover paper money.",
      "To solve this problem, people gradually start accepting a commodity that is divisible into smaller units and which they believe are widely demanded. Take butter for example. You accept it in exchange for the shoes you’ve made because you know you can find someone who wants butter easily and can pay him with a fraction of the butter weight you think is worth what that person is selling.",
      "By manipulating these limits on reserves and via other regulations (such as deciding interbank loan rates), the central bank (which is an arm of the government) directly determines how much money is out there in the economy and hence control the rate of inflation in the economy."
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "3248300194": {
    "time_read": "2021-02-07",
    "title": "Interview advice that got me offers from Google, Microsoft, and Stripe",
    "author": [
      "Zain Rizvi"
    ],
    "link": "https://www.zainrizvi.io/blog/the-interviewing-advice-no-one-shares/",
    "tags": [
      "interview--tips"
    ],
    "annotations": [
      "Recruiters aren’t evaluating you technically, not by the time you pick up the phone anyways. Their decision on whether you have the technical chops to be worth interviewing was made well before that call.",
      "Ask them questions!",
      "Why discard strong candidates who can’t interview well? They’ll level the playing field by helping everyone show their best selves when interviewing.",
      "Stay open to serendipity",
      "Learn to answer the more ambiguous questions",
      "It's an extremely liberating feeling knowing that even if you lose your job you'll be able to find another one quickly. That's a huge stress off your back.",
      "After each interview write down all the questions you were asked. The same evening look over the questions while they’re still fresh in your mind. Focus especially on the behavioral and design ones which have no clear right answer. Consider how you could have responded better. Are there stories from your life you could have referenced? Wait a few days and look at them again. You’ll find better answers.",
      "As you do these interviews, you may discover that the “practice” company is actually interesting after all. Recruiters count on that.",
      "Tip #4: Keep your skills sharp even when you’re not job hunting",
      "You only get that experience in a real interview. And only real interviews teach you how to deal with it. The first interview will kick your ass. So will the second. But once you get a few under your belt you'll get used to the adrenaline rush. Perhaps enjoy it even. You'll become a bullfighter, confidently facing down the charging bull. That’s how you get over the fear.",
      "Tip #1: Use recruiters to your advantage",
      "What do all these tactics have in common? They eliminate your fear. The fear that holds you back from letting your best self out.",
      "Let your curiosity run free! Don’t cage it! And as an interviewer, I can attest: sincere interest is always a good sign.",
      "And be forthright about any problems you run into:",
      "Tip #2: Go to real interviews for practice",
      "Learn to deal with pressure"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3237641212": {
    "time_read": "2021-01-31",
    "title": "Software development topics I've changed my mind on after 6 years in the industry",
    "author": [],
    "link": "https://chriskiehl.com/article/thoughts-after-6-years",
    "tags": [
      "programming--tips",
      "programming__debugging"
    ],
    "annotations": [
      "YAGNI, SOLID, DRY. In that order.",
      "Typed languages are better when you're working on a team of people with various experience levels",
      "The word \"scalable\" has a mystical and stupefying power over the mind of the software engineer. Its mere utterance can whip them into a depraved frenzy. Grim actions have been justified using this word",
      "Clever code isn't usually good code. Clarity trumps all other concerns.",
      "So called \"best practices\" are contextual and not broadly applicable. Blindly following them makes you an idiot",
      "Software architecture probably matters more than anything else. A shitty implementation of a good abstraction causes no net harm to the code base. A bad abstraction or missing layer causes everything to rot.",
      "Talking directly to the customer always reveals more about the problem, in less time, and with higher accuracy",
      "Adding more technology is rarely a good call",
      "Designing scalable systems when you don't need to makes you a bad engineer.",
      "Code coverage has absolutely nothing to do with code quality",
      "DRY is about avoiding a specific problem, not an end goal unto itself."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3228006137": {
    "time_read": "2021-01-30",
    "title": "The Incentive Problem with MDR",
    "author": [],
    "link": "https://finshots.in/archive/the-incentive-problem-with-mdr/",
    "tags": [
      "money__cards"
    ],
    "annotations": [
      "They still have to do the tango. The only difference — They have to bear the cost themselves. So they did the only thing they could. They lobbied. The Indian Banks’ Association (IBA) sought compensation to the tune of ₹2000 crore a year, to run the RuPay/UPI infrastructure.",
      "A waiver of the PSP fee. Now bear in mind we haven’t yet discussed third party app providers. These are intermediaries in the digital ecosystem that also help facilitate UPI and RuPay transactions. Think Google Pay. And while most of them are loss-making as it stands, they did levy a small charge on banks (called the PSP fee) for helping them process digital transactions",
      " Let’s suppose you buy a box of chocolates for ₹100. You don’t have cash on you. So you decide to pay using your SBI debit card. This sets off an elaborate tango that involves multiple stakeholders. The moment you swipe your card, the store owner’s bank will receive the transaction information associated with your purchase. The bank will now have to verify with SBI if you’ve got enough money to pay for the purchase. And they’ll also have to see if all your information checks out.\n\nHowever, they can’t do it on their own. Instead, they’ll have to rely on a payment network operated by Visa, Mastercard or RuPay. Once these guys enter the fray, they’ll relay the information to SBI and after everything checks out, the money will finally be credited to the store owner’s account. That is after everyone has taken their cut. Your bank will take a small piece of the pie. The merchant’s bank will take its cut and the likes of Visa and Mastercard will take their share. And the store owner will only receive what’s left. In essence, if the MDR stood at 1%, he will receive ₹99 from your purchase."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3170702758": {
    "time_read": "2021-01-22",
    "title": "CMV: If a mental illness means you behave in a way that upsets or hurts someone, you still owe them an apology, or at least, an explanation.",
    "author": [],
    "link": "https://www.reddit.com/r/changemyview/comments/jslj7j/cmv_if_a_mental_illness_means_you_behave_in_a_way/",
    "tags": [
      "psychology",
      "social-skills"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "2419144881": {
    "time_read": "2021-01-08",
    "title": "Why Do React Hooks Rely on Call Order?",
    "author": [],
    "link": "https://overreacted.io/why-do-hooks-rely-on-call-order/",
    "tags": [
      "web__frontend"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "2371389940": {
    "time_read": "2021-01-08",
    "title": "Making Sense of React Hooks",
    "author": [
      "Dan Abramov"
    ],
    "link": "https://medium.com/@dan_abramov/making-sense-of-react-hooks-fdbde8803889",
    "tags": [
      "web__frontend"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "3147321058": {
    "time_read": "2021-01-08",
    "title": "How Apple Is Organized for Innovation",
    "author": [
      "Morten T. Hansen",
      "Joel M. Podolny"
    ],
    "link": "https://hbr.org/2020/11/how-apple-is-organized-for-innovation",
    "tags": [
      "business__management",
      "team__management"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "3195610645": {
    "time_read": "2020-12-13",
    "title": "What Is Your Time Worth?",
    "author": [
      "Greg Rosalsky"
    ],
    "link": "https://www.npr.org/sections/money/2020/12/08/943812834/what-is-your-time-worth",
    "tags": [
      "time__research"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "3171617071": {
    "time_read": "2020-11-29",
    "title": "The Big Lessons From History",
    "author": [
      "Morgan Housel"
    ],
    "link": "http://www.collaborativefund.com/blog/the-big-lessons-from-history/",
    "tags": [
      "business__management",
      "history",
      "life--tips",
      "psychology"
    ],
    "annotations": [
      " Calm plants the seeds of crazy.",
      "Lesson #4: Important things rarely have one cause.",
      "When there are no recessions, people get confident. When they get confident they take risks. When they take risks, you get recessions.",
      "Lesson #5: Risk is what you don’t see.",
      "Two things have plunged in the last 80 years: death from bacterial infection, and funding/development of new antibiotics that will combat future infections",
      "Everyone wants to believe they’re thinking independently, with an understanding of how things work and why things are happening. But everyone has only seen the world through the narrow lens of their own experiences and social circles",
      "It’s weird to think that Covid would be easier to deal with if we hadn’t made so much infectious-disease progress over the last century. But we did. So now it’s a generational nightmare. Calm plants the seeds of crazy.\n\nA lot of things work like that.",
      " Calm plants the seeds of crazy.",
      "Lesson #2: Progress requires optimism and pessimism to coexist.",
      "Nothing separates us from human beings in earlier eras than how much less disease affects us. If we moderns lived for one year with the sort of death rates our pre–industrial age ancestors perpetually lived with, we’d be in societal shock.",
      "In 1918 humans had never viewed a virus under a microscope. But “wear a mask and keep your distance” they understood better than we do today.",
      "Lesson #3: People believe what they want to believe, see what they want to see, and hear what they want to hear.",
      "it’s too hard to accept because it makes you feel like you’re not in control",
      " When met with the problem, “Either the model of how I think the world works is wrong, or this other person is wrong,” the path of least resistance is always to point at the other person.",
      "It’s hard to convince someone that they’re in danger of a risk they assume had been defeated. Some of why “it’s just the flu” became a phrase this year is because it’s normal to cling to something you’re familiar with when confronted with something you’re not.",
      "The best financial plan – and I think this extends beyond finance – is to save like a pessimist and invest like an optimist.",
      "Two things happen when you’re caught off guard. One is that you’re vulnerable, with no protection against what you hadn’t considered. The other is that surprise shakes your beliefs in a way that leaves you paranoid and pessimistic.",
      "Incentives are expert storytellers, able to convince you that nonsense is real, harm isn’t happening, value is being created, and that whatever you’re doing is just fine.",
      "Those can seem like conflicting skills. And they are. It’s intuitive to think you should either be an optimist or a pessimist. It’s hard to realize there’s a time and a place for both, and that the two can – and should – coexist. But it’s what you see in almost every successful long-term endeavor."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3148803133": {
    "time_read": "2020-10-29",
    "title": "API pagination design#",
    "author": [
      "Alexander Solovyov"
    ],
    "link": "https://solovyov.net/blog/2020/api-pagination-design/",
    "tags": [
      "programming__database",
      "web__performance"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "3148803210": {
    "time_read": "2020-10-29",
    "title": "How to waste your career, one comfortable year at a time",
    "author": [
      "Apoorva Govind"
    ],
    "link": "https://apoorvagovind.substack.com/p/how-to-waste-your-career-one-comfortable",
    "tags": [
      "career--tips"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "2678267960": {
    "time_read": "2020-10-27",
    "title": "The trick that makes you overspend",
    "author": [
      "David Robson"
    ],
    "link": "https://www.bbc.com/worklife/article/20190801-the-trick-that-makes-you-overspend",
    "tags": [
      "money",
      "psychology"
    ],
    "annotations": [
      "Psychologists still debate the exact reasons for this particular effect, but one idea is that the comparison with the decoy offers us an easy justification for an otherwise arbitrary decision. If you were to compare just A and B, it’s hard to know exactly how to appraise the trade-offs between cost and waiting time – how much money is 90 minutes’ extra wait really worth? ",
      "On a more positive note, scientists in the UK have also started to consider whether the decoy effect might be used to encourage people to make healthier life choices. Christian Von Wagner, a reader in behavioural science and health at University College London, for instance, recently explored people’s intentions to undergo a vital – but unpleasant – screening for colorectal cancer. He found that given the choice between arranging an appointment for the screening or not having the procedure at all, many people chose not to go. But if he also presented them with a third option – an appointment at a less convenient hospital with a longer waiting time, ie, the decoy – the uptake was greater.",
      " Once again, the presence of the decoy increased people’s intentions to undergo the procedure. “It was very clear evidence for the presence of the decoy effect,” Von Wagner says – and proved to be more effective than other strategies, such as trying to appeal to people’s conformity by emphasising the number of other people who were also taking the test."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3149823526": {
    "time_read": "2020-10-27",
    "title": "How to Overcome Loneliness",
    "author": [
      "Editorial Process"
    ],
    "link": "https://markmanson.net/how-to-overcome-loneliness",
    "tags": [
      "psychology"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "1457132347": {
    "time_read": "2020-10-01",
    "title": "r/GetMotivated - [TEXT] I just finished the online Coursera course \"Learning how to learn\". I highly recommend it to everyone and I summarized everything I learned from it.",
    "author": [],
    "link": "https://www.reddit.com/r/GetMotivated/comments/5950tm/text_i_just_finished_the_online_coursera_course/",
    "tags": [
      "learning--tips"
    ],
    "annotations": [],
    "favorite": 1,
    "source": "pocket"
  },
  "3094787764": {
    "time_read": "2020-08-31",
    "title": "I couldn’t abandon another side project",
    "author": [
      "Zain Rizvi"
    ],
    "link": "https://www.zainrizvi.io/blog/do-more-by-doing-less/",
    "tags": [
      "programming--tips",
      "psychology"
    ],
    "annotations": [
      "But the urge to add “useful” features doesn’t go away. There’s even a name for it: scope creep.\n\n"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3081903428": {
    "time_read": "2020-08-16",
    "title": "Let's build a Full-Text Search engine",
    "author": [],
    "link": "https://artem.krylysov.com/blog/2020/07/28/lets-build-a-full-text-search-engine/",
    "tags": [
      "programming__dsa",
      "programming__searchengine"
    ],
    "annotations": [
      "Because of the grammar rules, documents may include different forms of the same word. Stemming reduces words into their base form. For example, fishing, fished and fisher may be reduced to the base form (stem) fish.",
      "The core of FTS is a data structure called Inverted Index. The Inverted Index associates every word in documents with documents that contain the word."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3081406879": {
    "time_read": "2020-08-16",
    "title": "Ennui: How to Overcome Chronic Boredom",
    "author": [],
    "link": "https://effectiviology.com/ennui/",
    "tags": [
      "psychology"
    ],
    "annotations": [
      "The terms ‘ennui’ and ‘boredom’ are often used interchangeably. However, various distinctions have been drawn between these two terms, and in general, the main difference between boredom and ennui is that ‘boredom’ refers to a mental state that is short-tern and driven primarily by situational and environmental factors, while ‘ennui’ refers to a mental state that is chronic and driven primarily by dispositional (personality-based) factors.",
      "From a practical perspective, this distinction isn’t crucial. Rather, you can simply view ennui as a chronic type of boredom, that is often characterized by behaviors that aren’t necessarily associated with regular boredom, such as a sense of emptiness.",
      "In the state of ennui the world is emptied of its significance. Everything is seen as if filtered through a screen; what is filtered out and lost is precisely the element that gives meaning to existence. Music is no longer an aesthetic world of sound, but a series of notes. Instead of a painting, one sees only a conglomeration of meaningless colors on a canvas; a book becomes a series of words, one strung after the other. ",
      "Ennui (pronounced on-wee) is a type of chronic boredom, which generally involves weariness, dissatisfaction, and apathy, as well as the tendency to feel that everything is uninteresting and unfulfilling.",
      "Nevertheless, understanding the concept of ennui can be beneficial, because it represents a different mental state than depression, as shown above. Accordingly, some people will feel that the concept of ennui better captures how they feel, which in turn can help them better understand and resolve this issue.",
      "Furthermore, a notable problem with ennui is that some of the behaviors or states of mind that ennui leads to, such as inaction, fatigue, and isolation, are the very things that can cause a person to experience ennui more strongly.\n\n",
      "For example, one study on the topic discusses two additional types of boredom: apathetic boredom, where the bored individual is unconcerned with their environment, and agitated boredom, where the bored individual attempts to engage in meaningful activities, although their attempts to do so fail to satisfy them.",
      " As such, when deciding how to handle your ennui, you should try to figure out what causes you to experience it in the first place, in order to find the best technique for you to use.",
      "Though ennui and depression share many symptoms and can co-occur, these are two separate phenomena.\n\n"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3043230559": {
    "time_read": "2020-08-15",
    "title": "23 Alternative Career Paths that Software Developers Can Grow Into",
    "author": [
      "Karl Hughes"
    ],
    "link": "https://www.freecodecamp.org/news/alternative-career-paths/",
    "tags": [
      "career"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "3073853283": {
    "time_read": "2020-08-15",
    "title": "7 Overlooked Biases That Creep Into Your Work (And Undermine Its Success)",
    "author": [
      "Janet Mesh"
    ],
    "link": "https://blog.trello.com/7-overlooked-biases-that-creep-into-your-work-and-undermine-its-success",
    "tags": [
      "psychology__bias"
    ],
    "annotations": [
      "Biases, more specifically cognitive biases, are your unchecked tendencies to make decisions or take actions in an irrational way.",
      "“We're blind to our blindness. We have very little idea of how little we know. We're not designed to know how little we know,” ",
      "Bottom line: your brain will automatically create biased shortcuts when you encounter experiences or information that is different than your preconceptions.",
      "Many work meetings become unproductive due to bandwagon bias and groupthink because team members don’t feel comfortable challenging collective agreement or don’t even realize their level of conformity to the group’s beliefs.",
      "Hold onto your hat and jump on for a conforming ride. The bandwagon bias occurs when you adopt a belief just because more people hold that belief. This bias can lead to groupthink, which is the tendency for group members to over-conform to a leader.",
      "Confirmation bias is the tendency to trust information that confirms your preconceptions. At the same time, you ignore or dismiss opinions that disagree with your own, even if they are factual and valid.",
      "Self-serving bias causes you to do exactly this—claim your successes and ignore your failures. This means that when something good happens, you take the credit, but when something bad happens, you blame it on external factors.",
      "Practice honest self-criticism and reflection",
      "This is why it pays off to be the first one to offer a bolstering range instead of a firm number when negotiating your salary. The first offer will establish the possibilities in each person’s mind. ",
      "Diversify your team\n",
      "One region is the emotional part of the brain (the amygdala) that responds to fear. ",
      "If you’re a project manager, you may recognize this common bias.\nPlanning fallacy is the tendency to underestimate how long tasks will take to complete. On top of it, instead of accepting your own fault, you place the blame on outside factors such as delayed start dates or sick days.",
      "Will yourself to think in a specific way\n",
      "David McRaney, author of You Are Not So Smart, explains in his article about survivorship bias that “after any process that leaves behind survivors, the non-survivors are often destroyed or muted or removed from your view. If failures becomes invisible, then naturally you will pay more attention to successes.” "
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "3064585231": {
    "time_read": "2020-08-15",
    "title": "‘Success Addicts’ Choose Being Special Over Being Happy",
    "author": [
      "Arthur C. Brooks"
    ],
    "link": "https://www.theatlantic.com/family/archive/2020/07/why-success-wont-make-you-happy/614731/",
    "tags": [
      "psychology__happy"
    ],
    "annotations": [
      "Success in and of itself is not a bad thing, any more than wine is a bad thing. Both can bring fun and sweetness to life. But both become tyrannical when they are a substitute for—instead of a complement to—the relationships and love that should be at the center of our lives",
      "Some chalk this up to loneliness in the absence of alcohol—remember, it’s a relationship.",
      "Unfortunately, success is Sisyphean (to mix my Greek myths). The goal can’t be satisfied; most people never feel “successful enough.” The high only lasts a day or two, and then it’s on to the next goal. Psychologists call this the hedonic treadmill, in which satisfaction wears off almost immediately and we must run on to the next reward to avoid the feeling of falling behind.",
      "Maybe—but maybe not. It might well be the story of someone whose never-ending quest for more and more success leaves them perpetually unsatisfied and incapable of happiness.",
      "The second step is to make amends for any relationships you’ve compromised in the name of success.",
      " They (and sometimes I) would put off ordinary delights of relaxation and time with loved ones until after this project, or that promotion, when finally it would be time to rest.",
      " As I once found myself confessing to a close friend, “I would prefer to be special than happy.” He asked why. “Anyone can do the things it takes to be happy—going on vacation with family, relaxing with friends … but not everyone can accomplish great things.”",
      "The last step is to find the right metrics of success. In business, people often say, “You are what you measure.”",
      "We can find this choice in ancient myth, as well. In Homer’s Iliad, Achilles must decide whether to fight in the Trojan War—promising certain physical death but a glorious legacy—or return to his home to live a long and happy life with his loved ones but die in obscurity.",
      "The first step is an admission that as successful as you are, were, or hope to be in your life and work, you are not going to find true happiness on the hedonic treadmill of your professional life. You’ll find it in things that are deeply ordinary: enjoying a walk or a conversation with a loved one, instead of working that extra hour",
      "The decision to keep drinking is to choose that intense love—twisted and lonely as it is—over the banality of mere happiness.",
      "More effective is simply to start showing up"
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2210750098": {
    "time_read": "2020-08-10",
    "title": "A cartoon intro to DNS over HTTPS – Mozilla Hacks : the Web developer blog",
    "author": [
      "Lin Clark"
    ],
    "link": "https://hacks.mozilla.org/2018/05/a-cartoon-intro-to-dns-over-https",
    "tags": [
      "programming__networks",
      "web__security"
    ],
    "annotations": [
      "Instead of doing this, Cloudflare will make the request from one of their own IP addresses near the user. This provides geolocation without tying it to a particular user.",
      "And there’s no way to know in advance which path the note is going to take, so there’s no telling what kind of people will have access to it.",
      "Normally, a resolver would send the whole domain name to each server—to the Root DNS, the TLD name server, the second-level name server, etc. But Cloudflare will be doing something different. It will only send the part that is relevant to the DNS server it’s talking to at the moment. This is called QNAME minimization.\n\n",
      "Even if you trust your network’s recommended resolver, you’re probably only using that resolver when you’re at home. Like I mentioned before, whenever you go to a coffee shop or hotel or use any other network, you’re probably using a different resolver. And who knows what its data collection policies are?",
      "With the rise of CDNs, more and more independent sites are being served by a single server.",
      "This is sometimes called HTTP/2 connection coalescing, or simply connection reuse. When you open a connection to a server that supports it, that server will tell you what other sites it hosts. Then you can visit those other sites using that existing encrypted connection.",
      "The problem with this is that anyone along the path can open up the note and read it.",
      " The resolver asks the Root DNS where it can find more info about addresses in the .org top-level domain.",
      " The tool that will go on this hunt for us and find the IP address is called a resolver.",
      "This next server is called a top-level domain (TLD) name server.",
      "This initial request is part of setting up encryption, but the initial request itself isn’t encrypted.",
      "You can configure your computer to use a resolver you trust. But very few people do this.",
      "One place where data is still exposed is in setting up the connection to the server.",
      "But if you’re on Megastore WiFi, you’re probably using their resolver. That resolver could hijack the request to big-box.com and lie to you, saying that the site is unavailable.",
      "by default, the OS will just use whatever resolver the network told it to.",
      "Many people and companies will pay lots of money to see what you are browsing for.",
      " This process — converting the domain name to an IP address — is called domain name resolution.",
      "But you can’t use a name for them. None of the routers would know who you were talking about.",
      "But more than that, it also means that anyone on the path to those servers sees your requests, too",
      "Wikipedia’s name server is what’s called the authoritative server.",
      "The resolver will also often include the first 24 bits of your IP address in the request. This helps the DNS server know where you are and pick a CDN closer to you. ",
      "This process is called recursive resolution, because you have to go back and forth asking different servers what’s basically the same question.",
      "This solves a lot of the security issues. But there are still some messages going between your browser and the server that aren’t encrypted.",
      "Even for users who do know the risks, it’s hard for an individual user to negotiate with their ISP or other entity to ensure that their DNS data is handled responsibly.",
      "The Root DNS will give the resolver an address for a server that knows about .org addresses.",
      "It knows of a few different Root DNS servers, so it sends the request to one of them",
      "So instead of having one list which keeps track of all of the domain names, there are lots of smaller lists that are linked to each other"
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2166351489": {
    "time_read": "2020-07-24",
    "title": "Solving the N+1 Problem for GraphQL through Batching",
    "author": [],
    "link": "https://engineering.shopify.com/blogs/engineering/solving-the-n-1-problem-for-graphql-through-batching",
    "tags": [
      "programming__database"
    ],
    "annotations": [
      "Both over-fetching and under-fetching waste valuable computing power and bandwidth.",
      "In REST, costs are predictable because there’s one trip per endpoint requested.",
      "For example, if there were fifty authors, then it would make fifty-one round trips for all the data. It should be able to fetch all the addresses together in a single round trip, so only two round trips to datastores in total, regardless of the number of authors. ",
      "How does GraphQL return data to those fields? It uses resolvers. ",
      "The n+1 problem arises because GraphQL executes a separate resolver function for every field, whereas REST has one resolver per endpoint",
      "GraphQL queries are made to a single endpoint, as opposed to multiple endpoints in REST. ",
      "Instead of the server expecting each field resolver to return a value, the library allows the resolver to request data and return a promise for that data",
      "In REST, the endpoint determines the type and amount of data returned. GraphQL, however, permits highly specific client-side queries that return only the data requested."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2020524010": {
    "time_read": "2020-07-20",
    "title": "How Operating Systems Work: 10 Concepts you Should Know as a Developer",
    "author": [
      "James Le"
    ],
    "link": "https://codeburst.io/how-operating-systems-work-10-concepts-you-should-know-as-a-developer-8d63bb38331f",
    "tags": [
      "programming__os"
    ],
    "annotations": [
      "Major components of an OS are the file system, scheduler, and device driver.",
      "A character device is one with which the driver communicates by sending and receiving single characters (bytes, octets). For example, serial ports, parallel ports, sounds cards, and so on",
      "The I/O device operates asynchronously with the CPU, and interrupts the CPU when finished.",
      "Specifically, it hides hardware complexity, manages computational resources, and provides isolation and protection.",
      " three key elements of an operating system, which are: (1) Abstractions (process, thread, file, socket, memory), (2) Mechanisms (create, schedule, open, write, allocate), and (3) Policies (LRU, EDF).",
      "There are two types of processes: Independent and Cooperating. ",
      "A context switch is the mechanism that stores and restores the state or context of a CPU in the Process Control block. ",
      "When a process executes, it passes through different states. These stages may differ in different operating systems, and the names of these states are also not standardized. ",
      "A thread is also called a lightweight process.",
      " Separation of mechanism and policy ",
      "Your operating system functions as that translator in your PC. It converts those 1s and 0s, yes/no, and on/off values into a readable language that you will understand.",
      "he variable names, constants, and instruction labels are the basic elements of the symbolic address",
      "It has its own program counter that keeps track of which instruction to execute next. ",
      "The process address space is the set of logical addresses that a process references in its code",
      "Optimization for common case",
      "Most importantly, it directly has privilege access to the underlying hardware.",
      "Context switches are computationally intensive, since register and memory state must be saved and restored",
      "no thread can exist outside a process",
      "A Process Control Block is a data structure maintained by the Operating System for every process. The PCB is identified by an integer process ID (PID). A PCB keeps all the information needed to keep track of a process as listed below:",
      "When the process is switched, the following information is stored for later use: Program Counter, Scheduling Information, Base and Limit Register Value, Currently Used Register, Changed State, I/O State Information, and Accounting Information.",
      "Symbolic addresses",
      "A block device is one with which the driver communicates by sending entire blocks of data. For example, hard disks, USB cameras, Disk-On-Key, and so on.",
      "The advantage to this method is that every instruction which can access memory can be used to manipulate an I/O device",
      "When a program is loaded into the memory and it becomes a process, it can be divided into four sections ─ stack, heap, text, and data",
      " The control information contains information like what to do if it runs out of buffer space, the sequence number, and its priority"
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2979251952": {
    "time_read": "2020-07-20",
    "title": "Second-guessing the modern web",
    "author": [
      "Tom MacWright"
    ],
    "link": "https://macwright.org/2020/05/10/spa-fatigue.html",
    "tags": [
      "web__frontend",
      "web__performance"
    ],
    "annotations": [
      "The user loads the page, which now has pre-rendered content, and then the JavaScript loads and makes the page interactive.",
      "The level of abstraction that React works on is too high, and the cost of using React - in payload, parse time, and so on - is too much for any company to include it as part of an SDK.",
      "So if they open the ‘about page’, keep the tab open for a week, and then request the ‘home page’, then the home page that they request is dictated by the index bundle that they downloaded last week.",
      " We’re layering optimizations upon optimizations in order to get the SPA-like pattern to fit every use case, and I’m not sure that it is, well, worth it.",
      "API calls being generic or reusable never seems to persist as a value in infrastructure. This is because a large portion of web applications are, at their core, query & transformation interfaces on top of databases. ",
      "The first is that the page you initially render is dead: you’ve created the Time To Interactive metric",
      "The less interactive parts don’t benefit much from React. Listing pages, static pages, blogs - these things are increasingly built in React, but the benefits they accrue are extremely narrow. A lot of the optimizations we’re deploying to speed up these things, things like bundle splitting, server-side rendering, and prerendering, are triangulating what we had before the rise of React.",
      "If you do SSR on any pages that are custom to the user, then you need to forward any cookies or authentication-relevant information to your API backend and make sure that you never cache the server-rendered result. ",
      "Web applications can’t sit on top of independently-designed APIs: to have a chance at performance, the application and its datasource need to be designed as one.",
      "This sort of solves the problem, but it’s not great. Most bundle splitting techniques require you to load that ‘index bundle’, and then only once that JavaScript is loaded and executed does your browser know which ‘page bundle’ it needs. So you need two round-trips to start rendering."
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "3051863521": {
    "time_read": "2020-07-20",
    "title": "This Is How To Overcome Impostor Syndrome: 4 Secrets From Research",
    "author": [
      "Eric Barker"
    ],
    "link": "https://www.bakadesuyo.com/2020/01/overcome-impostor-syndrome/",
    "tags": [
      "programming--tips",
      "psychology"
    ],
    "annotations": [
      "We’ve covered systems, models, and support.",
      ". As the great Carl Jung once said: “Until you make the unconscious conscious, it will direct your life and you will call it fate.”",
      "If you can reframe the feelings into something transient or unrelated to the task at hand then your self-efficacy doesn’t plummet.",
      "You attribute your accomplishments to luck or insane amounts of effort, but never talent or skill.",
      " But that said, if you don’t believe you can accomplish something, you probably won’t try. And even if you do try, when you meet resistance, you’ll give up.",
      "Impostor Syndrome is like being a secret agent — in the most depressing way imaginable.\n\n",
      " confidence is more generalized, while self-efficacy is task-specific.",
      "My self-efficacy about my ability to eat ice cream might be high, but I don’t think that makes me a good person.",
      "We need real answers, not platitudes",
      "When you do succeed, do you secretly feel like you fooled them again?\n",
      " It’s a belief, not an objective measure of ability. ",
      "Mood activates the subset of memories congruent with it through an associative mood network. Thus, a negative mood activates thoughts of past failings, whereas a positive mood activates thoughts of past accomplishments… According to Teasdale (1988), negative episodes and depressed mood activate a global view of oneself as inadequate and worthless rather than just activating unhappy memories.",
      "It’s called “self-efficacy.” ",
      "Perceived self-efficacy refers to beliefs in one’s capabilities to organize and execute the courses of action required to produce given attainments… People’s beliefs in their efficacy affect almost everything they do: how they think, motivate themselves, feel, and behave.",
      "Self-affirmations are as likely to cure this as they’d cure baldness"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2965367131": {
    "time_read": "2020-07-14",
    "title": "Things I Wished More Developers Knew About Databases",
    "author": [
      "Jaana Dogan"
    ],
    "link": "https://medium.com/@rakyll/things-i-wished-more-developers-knew-about-databases-2d0178464f78",
    "tags": [
      "programming__database"
    ],
    "annotations": [
      "As of today, MongoDB has journaling but dirty writes still can affect the durability of data because they are committing journals at every 100ms by default.",
      "but new approaches such as NoSQL movement gave birth to many databases without ACID transactions because they are expensive to implement.",
      "Committing to disk is an expensive process and by avoiding commits, they were claiming to be performant in writes while sacrificing durability.",
      "Reports such as the slow query logs, latency problems, or stats on execution times could be useful to determine the queries to optimize.",
      "An example of this type of anomalies is write skews",
      "Databases see transactions in the order they receive them not in the programming order developers see them.",
      "Some metrics the query planner provides could be noisy, especially when it estimates latency or CPU time. As a supplement to query planners, tracing and execution path tools can be more useful to diagnose these issues even though not every database provides such tools.",
      "Among ACID properties, consistency and isolation have the widest spectrum of different implementation details because the spectrum of tradeoffs is wider.",
      " If you can’t avoid them, you have to pay attention to avoid ending up surprising situations where committed transactions are accidentally aborted due to a child transaction.",
      "but if these functions are non-blocking and return immediately with a promise, the order of the invocation will be up to the time they have received at the database.",
      "Sharding is a way to horizontally partition your database",
      " a more comprehensive approach is to evaluate critical operations (per query and/or per transaction) separately.",
      "When data architects/developers can predict how data is going to be accessed, they might create horizontal partitions at the user-land instead of delegating this work to their database. This is called application-level sharding.",
      "Having sharding as a separate service can increase your capabilities on iterating on sharding strategies without having to redeploy your applications.",
      " Query planners have limited signals about what they can predict and might result in poor decisions.",
      "If atomicity is required (to either fully commit or abort all operations) and the sequence matter, the operations in T1 and T2 should run in a single database transaction.\n\n",
      "Without ACID or similar contracts, application developers wouldn’t have a guidance on what’s their responsibility versus what the databases provide.",
      " Sharding capabilities can be implemented as a layer in front of your database.",
      "Don’t assume knowing a lot about the internals of your current database is the only thing you need, scale will introduce new unknowns.",
      "A serial execution is one in which each transaction executes to completion before the next transaction begins. ",
      "Optimistic locking is a method when you read a row, you take note of a version number, last modified timestamps or its checksum. Then you can check the version hasn’t changed atomically before you mutate the record.",
      " Exclusive locks can be effected by network partitions more significantly and cause deadlocks that are hard to identify and resolve",
      "Transactions should be careful about in-application data races.",
      "Serializable isolation, schema design or database constraints can be helpful to eliminate write skews. ",
      "Online, realtime or live migrations mean migrating from one database to another without downtime and compromising data correctness",
      "Databases might advertise themselves as ACID but might still have different interpretation in edge cases or how they handle “unlikely” events. ",
      "Please consider the impacts of auto-incremented IDs vs UUIDs on indexing, partitioning and sharding before you decide on what works better for you.",
      "Query planners determine how your query is going to be executed in the database. They also analyze the queries and optimize them before running."
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "3045005819": {
    "time_read": "2020-07-13",
    "title": "A thread on managing time... I have had a wonderful relationship with time, for as long as I can remember. A lot of people graciously ask me…",
    "author": [
      "Ankur Warikoo"
    ],
    "link": "https://threadreaderapp.com/thread/1281498178135756801.html",
    "tags": [
      "time__management"
    ],
    "annotations": [
      "Physical energy: Quality of your sleep When and what do you eat Your fitness Emotional energy: Do you have self confidence? Do you talk positively to your own self? Mental energy: Are you creative Are you optimistic Spiritual energy: Do you have integrity, commitment? Honesty?"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "3045691749": {
    "time_read": "2020-07-13",
    "title": "The Secret to Giving a Compliment That Makes People Glow",
    "author": [
      "Mary Halton"
    ],
    "link": "https://getpocket.com/explore/item/the-secret-to-giving-a-compliment-that-makes-people-glow",
    "tags": [
      "social-skills--tips"
    ],
    "annotations": [
      "The next time you’re tempted to settle for a “Good job,” take a moment and either describe the effect that the job had on you (or other people) or name what was so special about what they did. Say something like, “I really appreciated the extra time you spent with that customer — I could tell it made a huge difference to them.”",
      "Make Your Compliment as Specific as Possible\n",
      "Use Their Name\n",
      "Try Not to Praise and Run\n"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "1960937976": {
    "time_read": "2020-06-21",
    "title": "The Cost Of JavaScript",
    "author": [
      "Addy Osmani"
    ],
    "link": "https://medium.com/dev-channel/the-cost-of-javascript-84009f51e99e",
    "tags": [
      "programming__javascript",
      "web__performance"
    ],
    "annotations": [
      "Minifying it",
      "Avoid memory leaks and frequent gc pauses to keep pages jank free.",
      "Byte-for-byte, JavaScript is more expensive for the browser to process than the equivalently sized image or Web Font — Tom Dale",
      "Compressing it heavily",
      "Progressive Bootstrapping may be a better approach. Send down a minimally functional page (composed of just the HTML/JS/CSS needed for the current route). As more resources arrive, the app can lazy-load and unlock more features.",
      "When you’re trying to keep parse/compile & network transmit times for JavaScript slow, there are patterns that can help like route-based chunking or PRPL.",
      "During runtime, long-running JavaScript can block the main-thread causing pages that are unresponsive. Chunking up work into smaller pieces (using requestAnimationFrame() or requestIdleCallback() for scheduling) can minimize responsiveness issues.",
      "tl;dr: less code = less parse/compile + less transfer + less to decompress",
      "Caching it to minimize network trips. Determine optimal lifetimes for scripts (max-age) & supply validation tokens (ETag) to avoid transferring unchanged bytes.",
      "Only shipping the code a user needs. Code-splitting can help here",
      "download & execution cost.",
      "Removing unused code",
      "Loading code proportionate to what’s in view is the holy grail. PRPL and Progressive Bootstrapping are patterns that can help accomplish this.\n\n"
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2993633582": {
    "time_read": "2020-06-11",
    "title": "The IKEA effect",
    "author": [
      "Dimitris Karapanos"
    ],
    "link": "https://stitcher.io/blog/the-ikea-effect",
    "tags": [
      "psychology__bias"
    ],
    "annotations": [
      "Wrap it up",
      "When working on a solution to a problem, the deeper you go, your focus switches to specifics parts of the problem. Many times those parts might require a disproportional amount of effort in order to solve them.",
      "The IKEA effect is a cognitive bias in which consumers place a disproportionately high value on products they partially created",
      "Read the instructions: don't jump into the solution without understanding the problem.",
      "Maybe the problem is too hard for your level of expertise. There is no shame in this. Communicate it early with your senior experts ask for tips, pair coding, anything that can help you grow your game to be able to fight the beast.",
      "Rebuild it",
      "The worst part is that the feedback is probably right, but your are already too blind to see or accept it.",
      "Early feedback",
      "if something doesn't feel right, gets weirdly complicated to model it in your solution, then it smells bad. Stop and revisit your approach better now than later",
      "Build a draft"
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2994338561": {
    "time_read": "2020-06-11",
    "title": "Build your own programming language",
    "author": [],
    "link": "https://thesephist.com/posts/pl/",
    "tags": [
      "programming__compilers"
    ],
    "annotations": [
      " But designing the semantics of the language is where you should spend the most of your time, because it’s where the language gets its “feel” and where you’ll learn the most",
      "So you may trade off the ease of parsing with execution complexity",
      "Do you treat errors like exceptions that bubble up through the call stack, or are errors treated like values, as in C and Go?"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "1235009523": {
    "time_read": "2020-05-10",
    "title": "Houdini: Maybe The Most Exciting Development In CSS You’ve Never Heard Of",
    "author": [],
    "link": "https://www.smashingmagazine.com/2016/03/houdini-maybe-the-most-exciting-development-in-css-youve-never-heard-of/",
    "tags": [
      "web__frontend"
    ],
    "annotations": [
      "Many of the specifications listed above show code samples (for example, registerLayout and registerPaint). If you’re wondering where you’d put that code, the answer is in worklet scripts.",
      "And because it is so dynamic, it’s extremely extensible. ",
      "The bottom line is, imagine how much nicer your development life would be if you could use any CSS property and know for sure it was going to work, exactly the same, in every browser",
      "At first thought, writing more CSS polyfills might seem like the answer. With good polyfills, CSS could move as fast as JavaScript, right?\nSadly, it’s not that simple. Polyfilling CSS is incredibly hard and, in most cases, impossible to do in a way that doesn’t completely destroy performance.",
      "If you wanted to do this today, you’d have to write the transition for each of these elements manually, because you can’t transition the property itself.",
      "extend the CSS parser and tell it about new constructs — for example, new media rules, new pseudo-classes, nesting, @extends, @apply, etc.",
      "Worklets are similar to web workers, and they allow you to import script files and run JavaScript code that (1) can be invoked at various points in the rendering pipeline and (2) is independent of the main thread.",
      "In fact, this is one of the main selling points of almost all front-end libraries and frameworks today",
      "Wanting access and hooks into the browser’s styling process isn’t just about building fancy demos — it’s about giving developers and framework authors the power to do two primary things:\nto normalize cross-browser differences,\nto invent or polyfill new features so that people can use them today.",
      "The eventual APIs will allow developers to run logic in a compositor worklet, off the main thread, with support for modification of a limited subset of a DOM element’s properties. This subset will only include properties that can be read or set without forcing the rendering engine to recalculate layout or style (for example, transform, opacity, scroll offset).",
      "then you have to figure out a way to fake it by updating and modifying the DOM yourself. You have no access to the other steps in the rendering pipeline.",
      "The only part of the process you have full access to is the DOM. The CSSOM is somewhat open; however, to quote the Houdini website, it’s “underspecified, inconsistent across browsers, and missing critical features.”"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2713490771": {
    "time_read": "2020-05-10",
    "title": "Today I turn 33. Here are 33 lessons I’ve learned about being better with people",
    "author": [
      "Become More Compelling.com"
    ],
    "link": "https://www.reddit.com/r/socialskills/comments/czah6t/today_i_turn_33_here_are_33_lessons_ive_learned/",
    "tags": [
      "social-skills--tips"
    ],
    "annotations": [],
    "favorite": 1,
    "source": "pocket"
  },
  "2970294831": {
    "time_read": "2020-05-10",
    "title": "Here's a list of some of the things I have taken from stoicism, I'd like input/to add to it.",
    "author": [],
    "link": "https://www.reddit.com/r/Stoicism/comments/gc2u2m/heres_a_list_of_some_of_the_things_i_have_taken/",
    "tags": [
      "psychology__stoic"
    ],
    "annotations": [
      "There is no perfection.",
      "If anger is expressed, recognize it for what it is. A feeling of helplessness or a weak point made raw.",
      " Time is the only thing you actually have.",
      " Presence in the present.",
      "Fear nothing because you are temporary, want nothing because they are temporary.",
      ". A ship with no destination has no favorable winds.",
      "Stop speaking for your pain.",
      "Deserving of nothing.",
      "Do not mistake the absence of pleasure for suffering."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "1250051416": {
    "time_read": "2020-03-21",
    "title": "Classification And Regression Trees for Machine Learning",
    "author": [
      "Jason Brownlee"
    ],
    "link": "http://machinelearningmastery.com/classification-and-regression-trees-for-machine-learning/",
    "tags": [
      "programming__ml"
    ],
    "annotations": [
      "You can use pruning after learning your tree to further lift performance.",
      "The fastest and simplest pruning method is to work through each leaf node in the tree and evaluate the effect of removing it using a hold-out test set.",
      " A node that has all classes of the same type (perfect class purity) will have G=0, where as a G that has a 50-50 split of classes for a binary classification problem (worst purity) will have a G=0.5.",
      "The complexity of a decision tree is defined as the number of splits in the tree.",
      "The count of training members is tuned to the dataset, e.g. 5 or 10. It defines how specific to the training data the tree will be",
      "The representation for the CART model is a binary tree",
      "For classification the Gini cost function is used which provides an indication of how “pure” the leaf nodes are (how mixed the training data assigned to each node is).",
      "The selection of which input variable to use and the specific split or cut-point is chosen using a greedy algorithm to minimize a cost function.",
      "Creating a CART model involves selecting input variables and split points on those variables until a suitable tree is constructed.",
      "Tree construction ends using a predefined stopping criterion, such as a minimum number of training instances assigned to each leaf node of the tree.",
      "G = sum(pk * (1 – pk))"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2330096767": {
    "time_read": "2020-03-18",
    "title": "Inside look at modern web browser (part 4)",
    "author": [
      "Mariko\n          Kosaka"
    ],
    "link": "https://developers.google.com/web/updates/2018/09/inside-browser-part4",
    "tags": [
      "web__browser"
    ],
    "annotations": [
      "In order to mitigate this from happening, you can pass passive: true options in your event listener. This hints to the browser that you still want to listen to the event in the main thread, but compositor can go ahead and composite new frame as well.",
      "To minimize excessive calls to the main thread, Chrome coalesces continuous events (such as wheel, mousewheel, mousemove, pointermove, touchmove ) and delays dispatching until right before the next requestAnimationFrame.\n\n",
      "Since you only need to write one event handler for all elements, ergonomics of this event delegation pattern are attractive. However, if you look at this code from the browser's point of view, now the entire page is marked as a non-fast scrollable region",
      "When you hear \"input events\" you might only think of a typing in textbox or mouse click, but from the browser's point of view, input means any gesture from the user. Mouse wheel scroll is an input event and touch or mouse over is also an input event",
      "Hit test uses paint records data that was generated in the rendering process to find out what is underneath the point coordinates in which the event occurred.",
      " However, if you are building things like drawing application and putting a path based on touchmove coordinates, you may lose in-between coordinates to draw a smooth line. In that case, you can use the getCoalescedEvents method in the pointer event to get information about those coalesced events.",
      " However, the browser process is only aware of where that gesture occurred since content inside of a tab is handled by the renderer process. ",
      "Any discrete events like keydown, keyup, mouseup, mousedown, touchstart, and touchend are dispatched immediately.",
      "Since running JavaScript is the main thread's job, when a page is composited, the compositor thread marks a region of the page that has event handlers attached as \"Non-Fast Scrollable Region\"."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "469259107": {
    "time_read": "2020-03-17",
    "title": "Why Procrastinators Procrastinate",
    "author": [
      "Tim Urban"
    ],
    "link": "https://waitbutwhy.com/2013/10/why-procrastinators-procrastinate.html",
    "tags": [
      "psychology"
    ],
    "annotations": [
      "The Have-To-Dos may happen, but not the Want-To-Dos",
      " It’s unpleasant.",
      "The procrastinator ultimately sells himself short."
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2859806265": {
    "time_read": "2020-03-17",
    "title": "Why Performance Matters",
    "author": [
      "Jeremy\n          Wagner"
    ],
    "link": "https://developers.google.com/web/fundamentals/performance/why-performance-matters?hl=th",
    "tags": [
      "web__performance"
    ],
    "annotations": [
      "An effective method of building high performance applications is to audit what resources you send to users. ",
      ". It was common to bundle styles and scripts into large bundles in HTTP/1 environments. This was done because a large amount of requests was detrimental to performance. This is no longer the case now that HTTP/2 is on the scene, as multiple, simultaneous requests are cheaper.",
      " You can speed up your rendering by removing unnecessary overhead whenever possible.",
      ". JavaScript is the most expensive resource we serve on the web byte for byte, as it must not only be downloaded, but parsed, compiled and executed as well.",
      "rel=preload is one such resource hint that allows early fetches of critical resources before the browser would otherwise discover them. ",
      "Performance is about retaining users",
      "In the same DoubleClick by Google study cited above, it was found that sites loading within 5 seconds had 70% longer sessions, 35% lower bounce rates, and 25% higher ad viewability than sites taking nearly four times longer at 19 seconds. ",
      "If you must use a library, research for leaner alternatives. For example, Zepto is a smaller jQuery alternative, and Preact is a much smaller alternative to React.",
      "Knowing what we know about human behavior, users will only tolerate low performing applications for so long before abandoning them",
      "Migrate to HTTP/2. HTTP/2 addresses many performance problems inherent in HTTP/1.1, such as concurrent request limits and the lack of header compression."
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "1644742170": {
    "time_read": "2020-03-17",
    "title": "The Meaning of Life Is a Ham Sandwich",
    "author": [
      "Mark Manson"
    ],
    "link": "https://markmanson.net/the-meaning-of-life",
    "tags": [
      "life--tips"
    ],
    "annotations": [
      "Goals are good tools for building motivation. The problem is that, by themselves, they are arbitrary and empty.\n\nUnless there’s a why behind the goal full of meaning, the goal itself will provide little long-term happiness or satisfaction.",
      " Studies show that our overall well-being is deeply tied to the quality of our relationships, and the best way to build healthy relationships is through helping others",
      "Meaning requires action. Meaning is something that we must continually find and nurture. Consistently.",
      "It’s easy, when we start thinking of how insignificant we are on a cosmic scale of the universe, to start thinking there’s no point in doing anything unless we’re going to save the world or something. This is just a distraction. ",
      "Take a ham sandwich. I sat down to write this article hungry. That’s a problem in my life. And I promised myself I’d pump out this draft before going and making myself a sandwich. That gave this hour some extra meaning.\n\nAnd you know what? Maybe my wife’s hungry and I can make her one too. You know, make the world a better place and all that shit while I’m at it.",
      "Meaning is like the water of our psychological health. Without it, our hearts and minds will shrivel and die. ",
      "Meaning is the association that we draw between two experiences or events in our minds.",
      "Meaning must be sought out and replenished frequently.",
      "There has to be a deeper reason for your goals. Otherwise, the goals themselves will be empty and worthless in the long-run.",
      "When there is great meaning attached to something, like our child is sick and starving, we will go to insane lengths to make things right.",
      "Meaning is that effective at moving people.",
      "But here’s the kicker (and I swear I’m going to get to the ham sandwich): meaning is a resource that we must cultivate in our lives",
      "In a very real sense, the meaning of life is therefore to create meaning."
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "1676739678": {
    "time_read": "2020-03-17",
    "title": "Life Is a Video Game—Here Are the Cheat Codes",
    "author": [
      "Evidence-Based"
    ],
    "link": "https://markmanson.net/life-cheat-codes",
    "tags": [
      "life--tips"
    ],
    "annotations": [
      "Therapy also works in this regard. You go sit on a couch and say a bunch of things to this person who sits there and pretends to care. Then that person says your thoughts back to you, just in a different way. And then you’re like, “Oh wait, that sounds completely irrational. Thanks, Doc.” And then you get screwed over because your health insurance doesn’t cover it.",
      "Distractions were merely reactions to problems, and we will come to believe that there is something inherently flawed or wrong about us and we must hide it from other people at all costs.",
      "CHEAT #4: STOP FANTASIZING",
      "But worst of all, sometimes we come to believe that our Distraction is actually a Solution. We think that spending 12 hours a day at the office will give us the loving family we want, that playing violin in the park for spare change is a career waiting to happen.",
      "If you spend years fantasizing about that yacht, then chances are you’ll be the guy who will wreck the rest of his life just to buy it. If you obsessively fantasize about being admired and loved by all, then you will fail to stand up for yourself in those many moments where you’ll need to most.",
      "The more often you use a Solution or Distraction, the easier it will be to use again, to the point where it will eventually become unconscious and automatic.",
      "We can often spend years (or decades) pursuing what we believe will level us up only to discover that we’ve basically been tweaking our nipples for the last 12 years, and while it felt good, we have nothing to show for it.",
      "All reactions can be divided up in two ways: Solutions and Distractions.",
      "There’s an old saying that “sunlight is the best disinfectant.” Well, that’s true for ourselves as well. The only way to cure the darkest parts of yourself is to shine light on them.",
      "And so, we hide these things about ourselves, and to hide them, we must distract ourselves even further, and it just creates this downward spiral of Distraction and shame.",
      "CHEAT #3: STOP FUCKING COMPLAINING",
      "the purpose of Life is not to control what happens to you, but rather control and choose higher level reactions to what happens to you.",
      ". If at any point, Life runs out of problems to give us, then as players, we will unconsciously invent problems for ourselves",
      "Habits are necessary because they prevent you from falling back to previous Levels you’ve already conquered. A player, once they’ve found a Solution to a Level, must employ that Solution enough times to make it a Habit, thus mastering that level and allowing them to move on to the next Level.",
      "CHEAT #1: I AM RESPONSIBLE FOR THIS",
      "CHEAT #5: SHARE YOUR SHAME",
      "People complain not because something sucks. People complain because they’re looking for empathy and to feel connected with those around them.",
      "To observe your own thoughts and not be a fuckface, you need to get your thoughts out in front of you and pretend that they aren’t yours. Only then can you hear how utterly ridiculous they sound.\n\nOne common way to do this is to write down your thoughts regularly.",
      "Fantasies are like any other Distraction – they are to be used sparingly and for nothing other than pure enjoyment. It’s when they begin to sustain your sense of self-worth, your desire for importance in this world, that you will be hobbling yourself, and you will never Level Up again in Life"
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2291753998": {
    "time_read": "2020-03-17",
    "title": "A quick introduction to web security",
    "author": [
      "Austin Tackaberry"
    ],
    "link": "https://medium.freecodecamp.org/a-quick-introduction-to-web-security-f90beaf4dd41",
    "tags": [
      "web__security"
    ],
    "annotations": [
      "At its core, HTTPS is fairly straightforward. HTTPS is encrypted and HTTP is not.",
      "If you are using public Wi-Fi with no password at a coffee shop, it’s pretty easy for someone to act like your router, so that all requests and responses go through them. If your data is not encrypted, then they can do whatever they want with it. They can edit the HTML, CSS, or JavaScript before it even gets to your browser. Given what we know about XSS, you can imagine how bad this could be.",
      " One month later, someone sends you a link to Facebook using HTTP, http://facebook.com, and you click on it. Since one month is less than the 15552000 seconds specified by the max-age directive, your browser will send the request as HTTPS, preventing a potential MITM attack.",
      "Well can superevilwebsite.rocks just change the origin header on their request, so that it looks like it is coming from facebook.com?\nThey can try, but it won’t work because the browser will just ignore it and use the real origin.",
      "Note that there are many more CSP directives than just these four shown above. The browser will read the CSP header and apply those directives to everything within the HTML file that was served. If the directives are set appropriately, they allow only what is necessary.",
      "CSP tries to prevent this from happening by limiting:\n\nwhat can be opened in an iframe\nwhat stylesheets can be loaded\nwhere requests can be made, etc."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "1162655354": {
    "time_read": "2020-03-16",
    "title": "The End of Small Talk",
    "author": [
      "Tim Boomer"
    ],
    "link": "https://www.nytimes.com/2016/01/17/fashion/dating-the-end-of-small-talk.html",
    "tags": [
      "social-skills"
    ],
    "annotations": [
      "I thought back to a dusty roadside in Costa Rica and the woman who shared her heart with four strangers. Why couldn’t we all embrace her openness? Why did being with a stranger so often mean we couldn’t immediately talk about meaningful things?",
      "They argued that some are not comfortable jumping directly into big talk, reasoning that certain people find small talk relaxing.",
      "“We’ll offer you a ride on two conditions. First, you must sing us a song, and then you have to tell us a story. Do you accept?”",
      "One was a teacher, and the other knew a teacher. How could they be destined for anything other than true love?",
      "All it takes is a willingness to dive into conversations that may make us uncomfortable or that many believe to be inappropriate for first encounters.",
      "With this in mind, I decided to approach my re-entry to dating with a no-small-talk policy.",
      "“Well, I had to, didn’t I? It was breaking my heart to be away from him.” She paused for a breath. “Although my husband came too; he’s back at the house.”",
      "Why can’t we replace small talk with big talk and ask each other profound questions right from the start? Replace mindless chatter about commuting times with a conversation about our weightiest beliefs and most potent fears? Questions that reveal who we are and where we want to go?",
      "I remembered the dusty hitchhiker in Costa Rica, the dates and the meaningful connections I’d made by escaping small talk. Even though my colleague and I weren’t on a date, we would still be spending a lot of time together in the foreseeable future, on business trips both short and long."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "1492117435": {
    "time_read": "2020-03-15",
    "title": "This Is Your Life in Social Media",
    "author": [
      "Sunil Rajaraman"
    ],
    "link": "https://thebolditalic.com/this-is-your-life-in-social-media-1b3f0c726532",
    "tags": [
      "social-media"
    ],
    "annotations": [],
    "favorite": 1,
    "source": "pocket"
  },
  "2879488009": {
    "time_read": "2020-03-15",
    "title": "Demystifying Browsers",
    "author": [
      "ericlaw"
    ],
    "link": "https://textslashplain.com/2020/02/09/demystifying-browsers/",
    "tags": [
      "web__browser--resource"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "2537636857": {
    "time_read": "2020-03-14",
    "title": "Data Structures and Algorithms",
    "author": [],
    "link": "https://discuss.codechef.com/t/data-structures-and-algorithms/6599",
    "tags": [
      "programming__dsa--resourc"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "989080860": {
    "time_read": "2020-03-03",
    "title": "Accessibility APIs: A Key To Web Accessibility",
    "author": [],
    "link": "https://www.smashingmagazine.com/2015/03/web-accessibility-with-accessibility-api/",
    "tags": [
      "web__accessibility"
    ],
    "annotations": [
      "A name that identifies it within the interface (if there is a visible label like text on a button, this will typically be its name, but it could be encoded directly in the object);",
      "With the text-based DOS operating system, the characters on the screen and the cursor position were held in a screen buffer in the computer’s memory. Assistive technologies could obtain this information by reading directly from the screen buffer or by intercepting signals being sent to a monitor. ",
      " In the case of a form field, the name is usually taken from the label associated with the field:\n\n",
      "In browsers, the platform accessibility API is used both to make information about the browser itself available to assistive technologies and to expose information about the currently rendered content.",
      "Its role (for example, it might be a button, an application window or an image);",
      "The off-screen model has to independently calculate things like white-space management and alignment coordination, ",
      "information about the appearance of objects on the screen could be captured and stored in a database called an off-screen model. ",
      " Most elements already have implicit roles, however, which go along with the element type. For example:",
      "The arrival of graphical interfaces such as OS/2, Mac OS and Windows meant that key information about what was on the screen could no longer be simply read from a buffer. Everything was now drawn on screen as a picture, including pictures of text. So, assistive technologies on those platforms had to find a new way to obtain information from the interface.",
      "The accessibility API describes an object’s relationship to other objects to provide context. For example, a radio button would probably be one “sibling” within a group.",
      "Recognizing the objects in this off-screen model was done through heuristic analysis.",
      "An object might not convey useful information, and in any case it took some time to identify it, develop the heuristics needed to support it and then ship a new version of the screen reader. This created a delay between the introduction of new features and assistive technology’s ability to support it.",
      "To inform a user about an object, an assistive technology would try to determine what the object is by looking for identifying information. For example, in a Windows application, the screen reader might present the Window Class name of an object. ",
      " Instead of applying complex heuristics to determine what an on-screen object might be, assistive technologies could query the accessibility API for specific information about each object.",
      "The browser uses the HTML DOM, along with further information derived from CSS, to generate an accessibility tree hierarchy of the content it is displaying, and it passes that information to the platform accessibility API. ",
      "If authors don’t do the “right thing,” assistive technologies must look in other places to try to get an accessible name — if there is no label, then a title or some text content might be near the radio button, or its relationship to other elements might help the user through context.",
      "Its state or current condition (for example, a checkbox might currently be selected, partially selected or not selected).",
      "They dealt with this by intercepting the drawing calls sent to the graphics engine and using that information to create an alternate off-screen version of the interface.",
      "A human might look at that object (in the context of other information on screen) and correctly deduce it is a button. The heuristics required for an assistive technology to make the same deduction are actually very complex, which causes some problems."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2897998713": {
    "time_read": "2020-02-28",
    "title": "Why 543 KB keep me up at night",
    "author": [
      "Manuel Matuzovic"
    ],
    "link": "https://matuzo.at/blog/why-543kb-keep-me-up-at-night/",
    "tags": [
      "web__frontend",
      "web__performance"
    ],
    "annotations": [
      "I need 1.6 MB of JavaScript (7.2 MB uncompressed) to display a table with my billing history.",
      "Before HTTP2 this was kinda considered a bad practice, but with HTTP2 multiplexing, the number of requests that can be sent to the server at the same time is no longer limited",
      "A large DOM tree in combination with complicated styles might have a bad effect on page rendering",
      "By writing carefully I mean only creating DOM nodes you need and adding extra divs and spans only when necessary. In React, Fragments might help with that.",
      "Somehow we've collectively decided that it’s okay to publish garbage",
      " especially if they’re caching efficiently and prioritizing asset loading correctly",
      "but it could also be a team lead, product owner or client who simply doesn’t give devs enough time to care about quality",
      "Many accessibility issues derive from bad markup.",
      "When I say garbage, I mean slow, inaccessible, annoying, stressful, or intrusive web experiences.",
      "The big advantage of splitting CSS into multiple files is that browsers will download all of them, but only those needed to fulfill the current context will block rendering,",
      "It’s becoming increasingly clear that web performance isn’t solely an engineering problem, but a problem of people"
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2860971906": {
    "time_read": "2020-02-27",
    "title": "What I Learned from Reading \"The Pragmatic Programmer\"",
    "author": [
      "Pramono Winata"
    ],
    "link": "https://www.freecodecamp.org/news/thought-on-the-pragmatic-programmer/",
    "tags": [
      "programming--tips"
    ],
    "annotations": [
      "Show them a glimpse of the future and people will rally around you. Be a catalyst for change.",
      "One of the most basic principles we often forget about is clean code. As features are piling up more and more, the codebase become fatter and technical debt rises",
      "DRY principle",
      "When we are finally able to take pride in our code and own it, we will be able to leave a good legacy behind. And people will see our code as a signature. When they see our code, they'll know that it will be solid and well-written, by a professional.",
      "It’s time to step up your game. Work out what you can, don’t overdo it, but also make it reasonable. Once you got your complete idea, show it to people. They might think that “Yeah, it might be better if we had that.”",
      "When you have responsibility for something, you should be prepared to be held accountable for it.",
      "What this chapter discusses is actually simple: it’s about initiative and taking care of your stuff.",
      " Perform ruthless testing on your code, and remember that your code is not finished until you've covered every available test.",
      "Try not to leave “broken windows” unrepaired. When you find that kind of code, fix it up as soon as possible",
      "Provide options, don’t make lame excuses",
      "The book teaches us that there is more to programming than technical abilities.",
      "Relying on unknowns is very dangerous. When you are not sure what the code is supposed to do, try to simplify it and make sure that the code is reliable in its own right, not just reliable by chance.",
      "Try to find the best editor that you are most comfortable using. Learning and mastering it and it will increase your productivity by several times.",
      "Rely only on things you are sure of. Don’t program by coincidence."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "441565114": {
    "time_read": "2020-02-21",
    "title": "Library vs. Framework?",
    "author": [],
    "link": "https://www.programcreek.com/2011/09/what-is-the-difference-between-a-java-library-and-a-framework/",
    "tags": [
      "programming"
    ],
    "annotations": [
      "In this way, your code will be called by the framework when appropriately. ",
      "In framework, all the control flow is already there, and there's a bunch of predefined white spots that you should fill out with your code.",
      "The key difference between a library and a framework is \"Inversion of Control\". When you call a method from a library, you are in control. But with a framework, the control is inverted: the framework calls you.\n\n",
      "developers do not need to worry about if a design is good or not, but just about implementing domain specific functions",
      "A library is just a collection of class definitions."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2875427821": {
    "time_read": "2020-02-18",
    "title": "Scaling to 100k Users",
    "author": [],
    "link": "https://alexpareto.com/scalability/systems/2020/02/03/scaling-100k.html",
    "tags": [
      "web__devops",
      "web__scalability"
    ],
    "annotations": [
      "This is important when we need to serve larger file sizes like images or videos that take a long time to load + send across the world.",
      "A CDN will automatically cache our images at different data centers throughout the world.",
      "One thing to note is that splitting out entities is a key aspect of building a scalable application. ",
      "As the app continues to scale, we’re going to want to focus on splitting out services that can be scaled independently. For example, if we start to make use of websockets, it would make sense to pull out our websocket handling code",
      "A load balancer also enables autoscaling. ",
      "We’re also going to continue to bump up against limitations on the data layer. This is when we are going to want to start looking into partitioning and sharding the database.",
      "This is why I like to think of the client as separate from the API. It makes it very easy to reason about building for multiple platforms: web, mobile web, iOS, Android, desktop apps, third party services etc. They’re all just clients consuming the same API",
      "We should be using a cloud storage service to host static content at this point: think images, videos, and more (AWS’s S3 or Digital Ocean’s Spaces). In general, our API should avoid handling things like serving images and image uploads.",
      "The other plus of most cache services, is that we can scale them out easier than a database. Redis has a built in Redis Cluster mode that, in a similar way to a load balancer1,",
      " Most clouds have a managed version of these services: Elasticache on AWS and Memorystore on Google Cloud.",
      "What we also get out of this is redundancy. When one instance goes down (maybe it gets overloaded or crashes), then we have other instances still up to respond to incoming requests - instead of the whole system going down.",
      "Load balancers are very powerful. The key idea is that we place a load balancer in front of the API and it will route traffic to an instance of that service. This allows for horizontal scaling (increasing the amount of requests we can handle by adding more servers running the same code).",
      "We will want to make sure that we have monitoring installed using a service like New Relic or Datadog. This will ensure we understand what requests are slow and where improvement needs to be made.",
      "The other thing we can do now that our database has started to get hit quite a bit, is to add read replicas using our database management system. With the managed services above, this can be done in one-click. A read replica will stay up to date with your master DB, and will be able to be used for SELECT statements.",
      "One of the easiest ways to get more out of our database is by introducing a new component to the system: the cache layer.",
      "The API CPU and memory usage is low across the board - thanks to our load balancer adding 10 API instances to the environment - but we’re starting to get a lot of timeouts on requests…why is everything taking so long?\n\nAfter some digging we see it: the Database CPU is hovering at 80-90%. We’re maxed out.",
      "Nearly all highly scaled applications take ample advantage of caching, it’s an absolutely integral part of making a fast API. Better queries and more performant code are all a part of the equation, but without a cache none of these will be sufficient to scale to millions of users.",
      "Scaling the data layer is probably the trickiest part of the equation. While for API servers serving stateless requests, we can merely add more instances, the same is not true with most database systems. In this case, we’re going to explore the popular relational database systems (PostgreSQL, MySQL, etc.)."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2309420969": {
    "time_read": "2020-02-12",
    "title": "What’s Server Side Rendering and do I need it?",
    "author": [
      "Bartosz Szczeciński"
    ],
    "link": "https://medium.com/@baphemot/whats-server-side-rendering-and-do-i-need-it-cb42dc059b38",
    "tags": [
      "web__frontend",
      "web__performance"
    ],
    "annotations": [
      "There’s one more important thing you should consider when going with a client-side rendered app: search engines and social networks presence.",
      "componentDidMount is not called on the server — this means that none of your data-fetching that you’re used to place there will not be called; this is generally a good thing, as you should be providing the data as props if you need it. ",
      "If your target demographic falls into one of those groups they will have a bad experience using the site — for example will have to wait a lot longer, staring at the “Loading …” (or even worse — a blank screen) message.",
      "Libraries like react-snapshot can be added to your project, used to generate HTML copies of your application pages and save them to a specified folder. You can then deploy this folder alongside your JS bundle. This way, the HTML will be served along with the response allowing your site to be accessible by users with JavaScript disabled, search engines etc.",
      "any state generated on the server side will not be passed to the client application state; that means that if your backend fetches some data and uses it to render HTML, it will not be placed in the this.state that the browser sees",
      "A — Consider having your key pages as static",
      "One of the big selling point of the current generation of JS applications is the fact, that they can be ran on both the client (browser) and on server",
      "The downside of this solution is that all the content we want to generate must be available at build time — we can’t query any APIs to get it, we can’t pre-generate content that depends on user provided data (e.g. as URL).",
      "the end user is running an underpowered device, for example an older generation mobile device,",
      "react-dom library contains a separate, named export renderToString which works similarly to the render we know, but instead of rendering to the DOM, it renders the HTML as string.",
      "if you’re using a react router (e.g. @reach/router or react-router) you need to make sure that the proper URL is passed to the application when it’s rendered on the server — be sure to check the proper documentation!",
      "the end user is using a slow internet connection, especially mobile connection,",
      "emember that you need to delay your render (calling res.render) until the data is fetched, which might introduce some delay for your visitors",
      "This means that your site will have very hard time trying to get top position in the search results in anything but Google.",
      "At this moment we can use our browser HTML Inspector to view the complete rendered HTML, but when we view the actual source we will see nothing more than the above HTML code."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2854796627": {
    "time_read": "2020-02-12",
    "title": "Goodbye, Clean Code",
    "author": [],
    "link": "https://overreacted.io/goodbye-clean-code/",
    "tags": [
      "programming--tips"
    ],
    "annotations": [
      "I sure didn’t think deeply about any of those things. I thought a lot about how the code looked — but not about how it evolved with a team of squishy humans.",
      "Secondly, nothing is free. My code traded the ability to change requirements for reduced duplication, and it was not a good trade. For example, we later needed many special cases and behaviors for different handles on different shapes. ",
      "Let clean code guide you. Then let it go.",
      "A healthy engineering team is constantly building trust. Rewriting your teammate’s code without a discussion is a huge blow to your ability to effectively collaborate on a codebase together",
      " If someone tells us that abstraction is a virtue, we’ll eat it. And we’ll start judging other people for not worshipping “cleanliness”.",
      "Obsessing with “clean code” and removing duplication is a phase many of us go through. When we don’t feel confident in our code, it is tempting to attach our sense of self-worth and professional pride to something that can be measured. A set of strict lint rules, a naming schema, a file structure, a lack of duplication."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2254572821": {
    "time_read": "2020-02-12",
    "title": "An Invisible Tax on the Web: Video Codecs",
    "author": [],
    "link": "https://blog.mozilla.org/blog/2018/07/11/royalty-free-web-video-codecs",
    "tags": [
      "technology__video",
      "web__performance"
    ],
    "annotations": [
      " Mozilla uses Cisco’s OpenH264 in Firefox.",
      " Early estimates show licensing fees for H.265 could cost ten times more than today’s H.264. Who will absorb those costs? How much will companies like Netflix have to pass on in fee hikes to stay profitable?",
      "A codec is a piece of software that shrinks large media files so they can travel quickly over the internet.",
      "Most importantly, a royalty-free codec can help keep high-quality video affordable for everyone.",
      "With H.264, small players get a free ride. To help build momentum for the H.264 codec, Cisco announced in 2013 it would open-source H.264.",
      "Streaming video costs (a lot of) money. A lot of companies pay a lot of money to use H.264. They include software and networking companies; content creators and distributors like Netflix, Amazon, and YouTube; and chip manufacturers like ARM. Where does the money go? To MPEG-LA, which represents  tech innovators in the U.S., Japan, South Korea, Germany, France, and Holland.",
      "Over the last decade, several companies started building viable alternatives to patented video codecs. Mozilla worked on the Daala Project, Google released VP9, and Cisco created Thor for low-complexity videoconferencing. ",
      "Here’s a surprising fact: It costs money to watch video online, even on free sites like YouTube. That’s because about 4 in 5 videos on the web today rely on a patented technology called the H.264 video codec.",
      "In 2015, Mozilla, Google, Cisco, and others joined with Amazon and Netflix and hardware vendors AMD, ARM, Intel, and NVIDIA to form AOMedia. As AOMedia grew, efforts to create an open video format coalesced around a new codec: AV1. AV1 is based largely on Google’s VP9 code and incorporates tools and technologies from Daala, Thor, and VP10",
      "Will Cisco cover licensing fees for HEVC/H.265 as well? If not, what impact will royalties have on web development?",
      "It can open up business opportunities, and remove barriers to entry for entrepreneurs, artists, and regular people",
      "Better compression opens the door to two key business benefits: better video quality and lower bandwidth costs",
      "The second reason we love AV1 is that it delivers better compression technology than even high-efficiency codecs – about 30% better, ",
      "If not for Cisco’s generosity, Mozilla would be paying estimated licensing fees of $9.75 million a year.",
      "Today,  more than 70% of all internet traffic is video, and that percentage is predicted to top 80% in the next few years.",
      "As web users, we take this performance for granted. But the truth is, companies pay millions of dollars each year to bring us free video – and the bills are only going to get bigger."
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2857852613": {
    "time_read": "2020-02-12",
    "title": "Notes on Technical Writing",
    "author": [],
    "link": "https://mkaz.blog/misc/notes-on-technical-writing/",
    "tags": [
      "writing--tips"
    ],
    "annotations": [
      "Choose an action-oriented approach. Users typically want to do things.",
      "Put the most important information first",
      "Engage in an active dialog, invite users to act “Please try”, “See what happens”, “Explore yourself”",
      "Support error recognition and recovery. ",
      "One idea per paragraph",
      "Don’t tell the reader something is extremely complex; likewise don’t tell the reader something is simple. The reader will make up their own mind about a concept being easy or hard.",
      "Support reading to do, study and locate. ",
      "The purpose of technical writing is to help users accomplish tasks as quickly and effectively as possible",
      "Anchor the tool in the task domain. ",
      "Get users to their first success quickly.",
      "People learn by doing, prefer to be shown and not told",
      "Organize material in a spiral, so it continually builds upon what they have already learned."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2855755651": {
    "time_read": "2020-02-12",
    "title": "Why API responses should be signed",
    "author": [],
    "link": "https://shkspr.mobi/blog/2020/01/why-api-responses-should-be-signed/",
    "tags": [
      "web__backend--ideas",
      "web__security--ideas"
    ],
    "annotations": [
      "But we need to build a better foundation for the future. One where information brokers can say \"I have proof that this exact data came from this specific website at this precise time.\"",
      "As the recipient of some data, I want to verify who originally published it.",
      "It relies on a few assumptions. Mostly that a GET operation is Immutable in terms of what it returns. That is, the data returned from a query is always the same.",
      "But in the data world, we get no such assurances",
      "I've just made that up. But you've got no way to prove that it did not come from Twitter. Perhaps it was a real Tweet which was subsequently deleted?",
      "The problem with all of the above approaches is that the API provider needs to safely and securely manage cryptographic keys. That's expensive and complicated. If an attacker got access to the keys, they could issue fake statements.",
      "If you want someone to verify an API response, they need two separate files and need to load them in the right order into any verification system. Again, not an impossible task, but might make things more complicated than necessary.",
      ". Or a source leaks information from a social network. How can you prove that the data is authentic and unaltered? Or someone else could present false data as coming from a trusted source. Or a trusted source could publish fake data and later claim they didn't.",
      "They have an image of a tweet. But you wouldn't trust an image of a website (I hope) without a checking a live link",
      "The usual way around this is to encode the result first. So, imagine your API response was BASE64 encoded and then signed. ",
      "If I call https://api.example.com/?id=123 myself, then I can be reasonably sure that the data has come from the server unaltered.",
      "As the recipient of some data, I want to verify that it hasn't been tampered with.",
      "Here's the end result that I want.\n\nGiven a piece of data,\nProve that where it came from and,\nProve that it hasn't been altered.",
      "The API call example.com/?id=123 returns some JSON containing the data requested.\nThe API call example.com/?id=123&signed=true returns the signature only."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2878706942": {
    "time_read": "2020-02-12",
    "title": "The Missing Semester of Your CS Education",
    "author": [],
    "link": "https://missing.csail.mit.edu/?utm_source=Pointer&utm_campaign=f08a6673a8-ISSUE_171_COPY_01&utm_medium=email&utm_term=0_6ba2b83261-f08a6673a8-592502357",
    "tags": [
      "programming--resource"
    ],
    "annotations": [],
    "favorite": 0,
    "source": "pocket"
  },
  "2470872470": {
    "time_read": "2020-02-02",
    "title": "3 Ways to Fix the CORS Error — and How Access-Control-Allow-Origin works",
    "author": [
      "David Katz"
    ],
    "link": "https://medium.com/@dtkatz/3-ways-to-fix-the-cors-error-and-how-access-control-allow-origin-works-d97d55946d9",
    "tags": [
      "web__security"
    ],
    "annotations": [
      "\nFix one: install the Allow-Control-Allow-Origin plugin",
      "The only trouble is that the browser automatically includes any relevant cookies stored for a domain when another request is made to that exact domain. ",
      "The one downside of the cors-anywhere proxy is that can often take a while to receive a response. The latency is high enough to make your applications appear a bit sluggish.",
      "Under the hood, the browser checks if the origins of the web application and the server match. ",
      "For every HTTP request to a domain, the browser attaches any HTTP cookies associated with that domain. This is especially useful for authentication, and setting sessions. ",
      "But really, the origin is the combination of the protocol, host, and port",
      "The error stems from a security mechanism that browsers implement called the same-origin policy.\n\nThe same-origin policy fights one of the most common cyber attacks out there: cross-site request forgery. In this maneuver, a malicious website attempts to take advantage of the browser’s cookie storage system.",
      "Fix three: build your own proxy",
      "In summary, you’re taking advantage of the fact that the same origin policy is only implemented in browser-to-server communication. Which means it doesn’t have to be enforced in server-to-server communication!",
      "To conduct the same-origin check, the browser accompanies all requests with a special request that sends the domain information receiving server.",
      "Fix two: send your request to a proxy",
      "Reacting to this special request, the server sends back a response header. This header contains an Access-Control-Allow-Origin key, to specify which origins can access the server’s resources. The key will have one of two values:",
      "\nThe evil site also has the ability send a request to facebook-clone.com/api. Since the request is going to the facebook-clone.com domain, the browser includes the relevant cookies. Evil-site sends the session cookie, and gains authenticated access to facebook-clone. Your account has been successfully hacked with a cross-site request forgery attack."
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2330096752": {
    "time_read": "2020-01-21",
    "title": "Inside look at modern web browser (part 3)",
    "author": [
      "Mariko\n          Kosaka"
    ],
    "link": "https://developers.google.com/web/updates/2018/09/inside-browser-part3",
    "tags": [
      "web__browser"
    ],
    "annotations": [
      "The most important thing to grasp in rendering pipeline is that at each step the result of the previous operation is used to create new data. For example, if something changes in the layout tree, then the Paint order needs to be regenerated for affected parts of the document.",
      "This is because the HTML specification is designed to handle those errors gracefully. ",
      "Now that the browser knows the structure of the document, the style of each element, the geometry of the page, and the paint order, how does it draw a page? Turning this information into pixels on the screen is called rasterizing.",
      "You can divide JavaScript operation into small chunks and schedule to run at every frame using requestAnimationFrame(). ",
      "Similarly, if a pseudo class with content like p::before{content:\"Hi!\"} is applied, it is included in the layout tree even though that is not in the DOM.",
      "\"There is a big red circle and a small blue square\" is not enough information for your friend to know what exactly the painting would look like.\n\n",
      "Even if you do not provide any CSS, each DOM node has a computed style. <h1> tag is displayed bigger than <h2> tag and margins are defined for each element. This is because the browser has a default style sheet.",
      "Sometimes parts of your JavaScript is handled by worker threads if you use a web worker or a service worker. Compositor and raster threads are also run inside of a renderer processes to render a page efficiently and smoothly.",
      "The benefit of compositing is that it is done without involving the main thread. Compositor thread does not need to wait on style calculation or JavaScript execution. This is why compositing only animations are considered the best for smooth performance. If layout or paint needs to be calculated again then the main thread has to be involved.",
      "If scroll happens, since layers are already rasterized, all it has to do is to composite a new frame.",
      "Even if your rendering operations are keeping up with screen refresh, these calculations are running on the main thread, which means it could be blocked when your application is running JavaScript.",
      "When the HTML parser finds a <script> tag, it pauses the parsing of the HTML document and has to load, parse, and execute the JavaScript code. Why? because JavaScript can change the shape of the document using things like document.write() which changes the entire DOM structure ",
      "The compositor thread can prioritize different raster threads so that things within the viewport (or nearby) can be rastered first",
      " If there are things like <img> or <link> in the HTML document, preload scanner peeks at tokens generated by HTML parser and sends requests to the network thread in the browser process.",
      "The main thread parses CSS and determines the computed style for each DOM node.",
      "Perhaps a naive way to handle this would be to raster parts inside of the viewport. If a user scrolls the page, then move the rastered frame, and fill in the missing parts by rastering more. This is how Chrome handled rasterizing when it was first released. However, the modern browser runs a more sophisticated process called compositing.",
      " You know the size, shape, and location of elements, but you still have to judge in what order you paint them.",
      "A layer also has multiple tilings for different resolutions to handle things like zoom-in action.",
      "If certain parts of a page that should be separate layer (like slide-in side menu) is not getting one, then you can hint to the browser by using will-change attribute in CSS.",
      "When the renderer process receives a commit message for a navigation and starts to receive HTML data, the main thread begins to parse the text string (HTML) and turn it into a Document Object Model (DOM).",
      "\nDraw quads\tContains information such as the tile's location in memory and where in the page to draw the tile taking in consideration of the page compositing.\nCompositor frame\tA collection of draw quads that represents a frame of a page.",
      "Compositing is a technique to separate parts of a page into layers, rasterize them separately, and composite as a page in a separate thread called compositor thread. ",
      "Once the layer tree is created and paint orders are determined, the main thread commits that information to the compositor thread. The compositor thread then rasterizes each layer. A layer could be large like the entire length of a page, so the compositor thread divides them into tiles and sends each tile off to raster threads. Raster threads rasterize each tile and store them in GPU memory.",
      "There are many ways web developers can send hints to the browser in order to load resources nicely. If your JavaScript does not use document.write(), you can add async or defer attribute to the <script> tag. The browser then loads and runs the JavaScript code asynchronously and does not block the parsing. You may also use JavaScript module if that's suitable. <link rel=\"preload\"> is a way to inform browser that the resource is definitely needed for current navigation and you would like to download as soon as possible. You can read more on this at Resource Prioritization – Getting the Browser to Help You.",
      "If you are animating elements, the browser has to run these operations in between every frame. ",
      "The layout is a process to find the geometry of elements. The main thread walks through the DOM and computed styles and creates the layout tree which has information like x y coordinates and bounding box sizes. Layout tree may be similar structure to the DOM tree, but it only contains information related to what's visible on the page. If display: none is applied, that element is not part of the layout tree (however, an element with visibility: hidden is in the layout tree). ",
      "At this paint step, the main thread walks the layout tree to create paint records. Paint record is a note of painting process like \"background first, then text, then rectangle\".",
      "You might be tempted to give layers to every element, but compositing across an excess number of layers could result in slower operation than rasterizing small parts of a page every frame, so it is crucial that you measure rendering performance of your application. For more about on topic, see Stick to Compositor-Only Properties and Manage Layer Count.",
      "Determining the Layout of a page is a challenging task. Even the simplest page layout like a block flow from top to bottom has to consider how big the font is and where to line break them because those affect the size and shape of a paragraph; which then affects where the following paragraph needs to be."
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2315562319": {
    "time_read": "2020-01-20",
    "title": "Inside look at modern web browser (part 2)",
    "author": [
      "Mariko\n          Kosaka"
    ],
    "link": "https://developers.google.com/web/updates/2018/09/inside-browser-part2",
    "tags": [
      "web__browser"
    ],
    "annotations": [
      "Navigation Preload is a mechanism to speed up this process by loading resources in parallel to service worker startup. It marks these requests with a header, allowing servers to decide to send different content for these requests; for example, just updated data instead of a full document.\n\n",
      "beforeunload can create \"Leave this site?\" alert when you try to navigate away or close the tab. ",
      "Once all of the checks are done and Network thread is confident that browser should navigate to the requested site, the Network thread tells UI thread that the data is ready. UI thread then finds a renderer process to carry on rendering of the web page.\n\n",
      "This is also where the SafeBrowsing check happens. If the domain and the response data seems to match a known malicious site, then the network thread alerts to display a warning page.",
      "Once the renderer process \"finishes\" rendering, it sends an IPC back to the browser process (this is after all the onload events have fired on all frames in the page and have finished executing). At this point, the UI thread stops the loading spinner on the tab.",
      "so the UI thread needs to parse and decide whether to send you to a search engine, or to the site you requested.\n\n",
      "Additionally, Cross Origin Read Blocking (CORB) check happens in order to make sure sensitive cross-site data does not make it to the renderer process.",
      "This way, \nif all goes as expected, a renderer process is already in standby position when the network thread \nreceived data. ",
      "When a user hits enter, the UI thread initiates a network call to get site content. Loading spinner is displayed on the corner of a tab, and the network thread goes through appropriate protocols like DNS lookup and establishing TLS Connection for the reques",
      "When the UI thread is sending a URL request to \nthe network thread at step 2, it already knows which site they are navigating to. The UI thread \ntries to proactively find or start a renderer process in parallel to the network request",
      "If the navigation was initiated from the renderer process (like user clicked on a link or client-side JavaScript has run window.location = \"https://newsite.com\") the renderer process first checks beforeunload handlers. ",
      "Now that the data and the renderer process is ready, an IPC is sent from the browser process to the renderer process to commit the navigation. It also passes on the data stream so the renderer process can keep receiving HTML data. Once the browser process hears confirmation that the commit has happened in the renderer process, the navigation is complete and the document loading phase begins.",
      "When a navigation happens, network thread checks the domain against registered service worker scopes, if a service worker is registered for that URL, the UI thread finds a renderer process in order to execute the service worker code.",
      "The important part to remember is that service worker is JavaScript code that runs in a renderer process. ",
      "The response's Content-Type header should say what type of data it is, \nbut since it may be missing or wrong, \nMIME Type sniffing \nis done here.",
      " Service worker is a way to write network proxy in your application code; allowing web developers to have more control over what to cache locally and when to get new data from the network.",
      "When the new navigation is made to a different site than currently rendered one, a separate render process is called in to handle the new navigation while current render process is kept around to handle events like unload. "
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2856968914": {
    "time_read": "2020-01-20",
    "title": "Three Steps To Get Up To Speed On Any Subject Quickly",
    "author": [],
    "link": "https://getpocket.com/explore/item/three-steps-to-get-up-to-speed-on-any-subject-quickly",
    "tags": [],
    "annotations": [
      " To make things worse, Greenwald confesses he is \"a very slow reader\" who doesn't have time to consume huge piles of research or take multiple passes through material. To survive in the newsroom, he developed two routines.",
      "No one warns us that adulthood is full of such sweat-inducing dilemmas, where the stakes are your reputation, your career, and (rightly or wrongly) even your sense of self-worth. When you’re in over your head, how do you quickly figure out what’s important?",
      "Write out everything you know about the subject as if you were teaching it to someone else. Not your smart friend but rather a toddler. This may sound silly, but this part is incredibly important and has worked wonders for me learning new things",
      "To prevent getting sucked into a time-wasting vortex of endless searching, Greenwald says it’s important to move on after the initial search. You've got to do it in one sitting. \"Whatever I get there, that’s it—I’m done at that point,\" he says. \"It’s a limited view, but it skims the cream.\"",
      "Get Inside the Right People’s Heads (Not Just the Experts’)",
      "And the best cream, according to Greenwald, is something you wouldn’t expect a business journalist to search for: pictures. Particularly when the information he’d like to understand involves data, Greenwald suggests looking for images, which convey dense information better than text or raw numbers."
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2851645783": {
    "time_read": "2020-01-19",
    "title": "The Ultimate Productivity Hack is Saying No",
    "author": [
      "James Clear"
    ],
    "link": "https://jamesclear.com/saying-no",
    "tags": [
      "productivity--tips"
    ],
    "annotations": [
      "We become frustrated by our obligations even though we were the ones who said yes to them in the first place.",
      "When you say no, you are only saying no to one option. When you say yes, you are saying no to every other option.",
      "The opportunity cost of your time increases as you become more successful",
      "We agree to many requests not because we want to do them, but because we don't want to be seen as rude, arrogant, or unhelpful",
      "It’s easier to avoid commitments than get out of commitments. Saying no keeps you toward the easier end of this spectrum.",
      "The thought of straining the relationship outweighs the commitment of our time and energy.",
      "In reality, they are not just opposite in meaning, but of entirely different magnitudes in commitment.",
      "If an opportunity is exciting enough to drop whatever you're doing right now, then it's a yes. If it's not, then perhaps you should think twice.",
      "“If you don’t guard your time, people will steal it from you.”",
      "Do whatever favors you can, and be warm-hearted and direct when you have to say no.",
      "You need to say no to whatever isn't leading you toward your goals",
      "No is a decision. Yes is a responsibility",
      "It's worth asking if things are necessary. ",
      "This is not to say you should never attend another meeting, but the truth is that we say yes to many things we don't actually want to do. There are many meetings held that don't need to be held. There is a lot of code written that could be deleted.",
      "There is nothing so useless as doing efficiently that which should not be done at all"
    ],
    "favorite": 0,
    "source": "pocket"
  },
  "2836684751": {
    "time_read": "2020-01-14",
    "title": "KISS, DRY, and Code Principles Every Developer Should Follow",
    "author": [
      "Mahdhi Rezvi"
    ],
    "link": "https://medium.com/better-programming/kiss-dry-and-code-principles-every-developer-should-follow-b77d89f51d74",
    "tags": [
      "programming--tips"
    ],
    "annotations": [
      "This principle states that a piece of code should be implemented in just one place in the source code. ",
      "One good example of SoC is the MVC Architecture. ",
      "SoC (Separation of Concerns)",
      "DRY (Don’t Repeat Yourself)",
      "you’ll waste valuable time trying to speed up a function that isn’t as slow as you think or doesn’t get called as often as you’d expect.",
      "The opposite of DRY code is WET code: write everything twice",
      "People tend to write code that they may need in the future but not at the moment. These types of code increase the size of your program unnecessarily, as the written code is never implemented",
      "Avoid Premature Optimization",
      "The problem with premature optimization is that you can never really know where a program’s bottlenecks will be until after the fact",
      "Your code should evolve from ordinary functioning code to clean, efficient, understandable and maintainable code. ",
      "SoC principle is all about minding your own business — literally. This principle advises you to partition your complex code into different sections or domains. Each section is independent of each other, and that’s why each section can be tackled independently. Also, it becomes easier to maintain, update, and reuse the code.",
      "YAGNI (You Aren’t Gonna Need It)",
      "If you have a complex piece of code, always try to break it into smaller more maintainable code",
      "KISS (Keep It Simple Stupid)"
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2836109417": {
    "time_read": "2020-01-06",
    "title": "Read This If You’re Going Through Adversity",
    "author": [
      "Darius Foroux"
    ],
    "link": "https://getpocket.com/explore/item/read-this-if-you-re-going-through-adversity",
    "tags": [
      "psychology"
    ],
    "annotations": [
      "Too often, people feel too proud to ask for support. I’ll tell you this: No one on earth is strong enough to go through all adversity alone. Sure, you might be strong enough to deal with the challenges of life. But there always comes a time when things become “too much.”\n    \n\n    \n        That’s when you need help. When that time comes: Ask.",
      "We need to boost your dopamine. To do that, we need to reward ourselves (again, don’t buy anything). Do something that makes you enjoy life. That’s my standard.",
      "Sitting at home and feeling sorry for yourself is not going to help. ",
      "But in recent years, I’ve learned to adopt an active mindset. When I lose motivation, I either come up with a list of things I want to do or set some new goals for myself. And then, I start working on it.",
      "When you create a plan, you’re by definition looking at the future. And when we imagine a better future, we start feeling better.",
      "Well, what’s the worst thing that can happen? Will those things kill you? Probably not.\n    \n\n    \n        This exercise makes us aware of how irrational and fearful we are. Simply ask the question and spend some time meditating on it."
    ],
    "favorite": 1,
    "source": "pocket"
  },
  "2313472867": {
    "time_read": "2019-12-24",
    "title": "Inside look at modern web browser (part 1)",
    "author": [
      "Mariko\n          Kosaka"
    ],
    "link": "https://developers.google.com/web/updates/2018/09/inside-browser-part1",
    "tags": [
      "programming__os",
      "web__browser"
    ],
    "annotations": [
      "Well, it could be one process with many \ndifferent threads or many different processes with a few threads communicating over IPC.",
      "Chrome is undergoing architecture changes to \nrun each part of the browser program as a service allowing to easily split into different processes \nor aggregate into one",
      "A process can ask the Operating System to spin up another process to run different tasks.",
      "For the renderer process, multiple processes are created and assigned to \neach tab. ",
      "The following table describes each Chrome process and what it controls:",
      "A process can be described as an application’s executing program. A thread is the one that lives \ninside of process and executes any part of its process's program.",
      "Until very recently, Chrome gave each tab a process when it could; now it tries to give \neach site its own process, including iframes (see Site Isolation).",
      "If one tab becomes unresponsive, then you can close the unresponsive tab and move on while keeping \nother tabs alive. If all tabs are running on one process, when one tab becomes unresponsive, all \nthe tabs are unresponsive. That’s sad.",
      "it was first developed to handle graphics.",
      "Also handles the invisible, privileged parts of a web browser such as \n      network requests and file access.",
      "It is separated into different process \n      because GPUs handles requests from multiple apps and draw them in the same surface.",
      "Because processes have their own private memory space, they often contain copies of common \ninfrastructure (like V8 which is a Chrome's JavaScript engine). ",
      "A core is like another CPU living in \nthe same chip. In modern hardware, you often get more than one core, giving more computing power \nto your phones and laptops.",
      "can handle many different tasks \none by one as they come in. It can handle everything from math to art while knowing how to reply \nto a customer call.",
      "The Operating System gives the process a \"slab\" of memory to work \nwith and all application state is kept in that private memory space. When you close the \napplication, the process also goes away and the Operating System frees up the memory.",
      "In recent years, with GPU-accelerated computing, more and more computation is becoming possible on \nGPU alone.",
      "Usually, applications run on the CPU and GPU using mechanisms provided by the \nOperating System.",
      "One browser’s approach may \nbe completely different from another.",
      "Unlike CPU, \nGPU is good at handling simple tasks but across multiple cores at the same time. ",
      "but when Chrome hits \nthe limit, it starts to run multiple tabs from the same site in one process.",
      "Many applications \nare designed to work this way so that if a worker process get unresponsive, it can be restarted \nwithout stopping other processes which are running different parts of the application.",
      "In order to save memory, Chrome puts a limit on how many processes it can spin up. \nThe limit varies depending on how much memory and CPU power your device",
      "Another benefit of separating the browser's work into multiple processes is security and \nsandboxing. Since operating systems provide a way to restrict processes’ privileges, the browser \ncan sandbox certain processes from certain features. For example, the Chrome browser restricts \narbitrary file access for processes that handle arbitrary user input like the renderer process.",
      "The important thing to note here is that these different architectures are implementation details.",
      "At the top is the browser process coordinating with other processes that take care of different \nparts of the application"
    ],
    "favorite": 1,
    "source": "pocket"
  }
}